# Journey North Adult First Sightings

In [1]:
#  Import and read
import pandas as pd 
import numpy as np
import json
# Sue Mottet 2-19-2022

# geoJSONifier

In [2]:
def df_to_geojson(df, properties, lat='latitude', lon='longitude'):
    # create a new python dict to contain our geojson data, using geojson format
    geojson = {'type':'FeatureCollection', 'features':[]}

    # loop through each row in the dataframe and convert each row to geojson format
    for _, row in df.iterrows():
        # create a feature template to fill in
        feature = {'type':'Feature',
                   'properties':{},
                   'geometry':{'type':'Point',
                               'coordinates':[]}}

        # fill in the coordinates
        feature['geometry']['coordinates'] = [row[lon],row[lat]]

        # for each column, get the value and add it as a new feature property
        for prop in properties:
            feature['properties'][prop] = row[prop]
        
        # add this feature (aka, converted dataframe row) to the list of features inside our dict
        geojson['features'].append(feature)
    
    return geojson

# Load file

In [3]:
JNorth1996_2020_df = pd.read_csv("UWMadisonArb_JNorth_Project_MonarchsAndMilkweed_1996-2020.csv")
JNorth1996_2020_df.head()

C:\Users\motte\anaconda3\envs\mlenv\lib\site-packages\IPython\core\interactiveshell.py:3444: DtypeWarning: Columns (8) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

,id,sighting_date,species,number,latitude,longitude,flag_location,comments,school,grade,image_url,customerid,number_old,flag_number,species_old,flag_species
0,850841703,1996-12-16,Monarch Adult Sighted,1,27.594,-81.362,0,On the ballfield a solitary monarch butterfly ...,Walker memorial junior academy,10.0,-999999.999,135,-999999.999,1,Monarch Butterfly,1
1,851824801,1996-12-06,Monarch Adult Sighted,1,30.420,-87.224,0,Our 5th grade Discovery students who went alon...,Hambrick elementary school,5.0,-999999.999,150,-999999.999,1,Monarch Butterfly,1
2,854409931,1996-09-21,Monarch Adult Sighted,1,40.817,-96.710,0,We saw several hundred monarchs in our school ...,-999999.999,5.0,-999999.999,9701054,-999999.999,1,Monarch Butterfly,1
3,854557206,1996-09-21,Monarch Adult Sighted,1,40.817,-96.710,0,Over a hundered monarchs in our school butterf...,Fredstrom elementary school,6.0,-999999.999,175,-999999.999,1,Monarch Butterfly,1
4,855061862,1997-01-01,Monarch Adult Sighted,1,34.244,-77.946,0,"I Thought I Saw It, But I Was Suprised To See ...",Gregory,3.0,-999999.999,181,-999999.999,1,Monarch Butterfly,1

# Data Exploratory

In [4]:
JNorth1996_2020_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 227433 entries, 0 to 227432
Data columns (total 16 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             227433 non-null  int64
 1   sighting_date  227433 non-null  object
 2   species        227433 non-null  object
 3   number         227433 non-null  int64
 4   latitude       227433 non-null  float64
 5   longitude      227433 non-null  float64
 6   flag_location  227433 non-null  int64
 7   comments       227433 non-null  object
 8   school         227433 non-null  object
 9   grade          227433 non-null  float64
 10  image_url      227433 non-null  object
 11  customerid     227433 non-null  int64
 12  number_old     227433 non-null  float64
 13  flag_number    227433 non-null  int64
 14  species_old    227433 non-null  object
 15  flag_species   227433 non-null  int64
dtypes: float64(4), int64(6), object(6)
memory usage: 27.8+ MB

In [5]:
str(JNorth1996_2020_df.columns.tolist())

"['id', 'sighting_date', 'species', 'number', 'latitude', 'longitude', 'flag_location', 'comments', 'school', 'grade', 'image_url', 'customerid', 'number_old', 'flag_number', 'species_old', 'flag_species']"

In [6]:
JNorth1996_2020_df.describe()

,id,number,latitude,longitude,flag_location,grade,customerid,number_old,flag_number,flag_species
count,2.274330e+05,2.274330e+05,227433.000000,227433.000000,227433.000000,227433.000000,2.274330e+05,2.274330e+05,227433.000000,227433.000000
mean,1.420650e+09,1.186529e+02,38.400690,-87.569965,0.598018,-907386.217597,9.451737e+06,-2.844270e+05,0.294816,0.130324
std,1.456887e+08,2.209080e+04,5.268651,10.880362,0.490299,289894.342744,2.193961e+06,4.518136e+05,0.467089,0.336660
min,8.508417e+08,-1.700000e+01,-12.100000,-165.107000,0.000000,-999999.999000,0.000000e+00,-1.000000e+06,0.000000,0.000000
25%,1.377751e+09,1.000000e+00,34.723000,-95.268000,0.000000,-999999.999000,9.941050e+06,-1.000000e+06,0.000000,0.000000
50%,1.477448e+09,1.000000e+00,39.503000,-86.787000,1.000000,-999999.999000,9.977663e+06,1.000000e+00,0.000000,0.000000
75%,1.526383e+09,3.000000e+00,42.409000,-79.255000,1.000000,-999999.999000,1.000029e+07,3.000000e+00,1.000000,0.000000
max,1.526525e+09,1.000000e+07,65.136000,-52.883000,1.000000,1112.000000,1.004256e+07,1.000000e+07,2.000000,1.000000

In [7]:
JNorth1996_2020_df.columns.tolist()

['id',
 'sighting_date',
 'species',
 'number',
 'latitude',
 'longitude',
 'flag_location',
 'comments',
 'school',
 'grade',
 'image_url',
 'customerid',
 'number_old',
 'flag_number',
 'species_old',
 'flag_species']

In [8]:
JNorth1996_2020_df.shape

(227433, 16)

In [9]:
# Determine the number of unique values in each column.
for col in JNorth1996_2020_df:
  print(JNorth1996_2020_df[col].unique())

[ 850841703  851824801  854409931 ... 1526524404 1526524405 1526525021]
['1996-12-16' '1996-12-06' '1996-09-21' ... '2020-12-29' '2020-12-30'
 '2020-12-31']
['Monarch Adult Sighted' 'Monarch Adult (FIRST sighted)'
 'Monarch Egg (FIRST sighted)' 'Monarch (OTHER Observations)'
 'Monarch Larva (FIRST sighted)' 'Monarch PEAK Migration'
 'Milkweed (FIRST sighted)' 'Monarch Fall Roost' 'Monarch Egg Sighted'
 'Monarch Larva Sighted' 'Monarch, Captive-Reared' 'Milkweed Sighted']
[       1      150       20       89       30     2000       50     7500
       23      200        5      300        4      100       71      120
      325       21       28     5000    20000       36       25        6
       54     1000      160       24       60       37        2     3000
  1000000       10  2000000       40       85       65       15        8
      500       14      112       75       80    15000       18    10000
      912   100000      400      800       12       35      600       16
    25000     1500     1117       70        3      463       45       72
      250      182       56       26    30000     2500     8000      750
      700       46      556       34      275       53       22      650
      210      224     1100      240   200000      900     1200        7
       13      115       11       19      810       66       43      510
        9       62       27      290      104       44      440      202
       55      180       17      140      269       61      142      175
       41      123       32       76       31      195      125       29
      164      109      119      105     4000       69      360       88
       58      239       48      310      117       52      261       90
      135      296      211       39       51      102     7001      127
       49       47       33     1300       42      101     5075     1520
      170       81      190       38      110      558      381      228
      248       86       74      172      230      420     2806       94
       92      118      425     5400     6300       68       79    50000
     2300     7000       84      128       57      350       83      124
      114      450      147      501       87       77      197      840
    13460     3500       64       73      178      265      151      133
      121      477       59       97      850      130      165       95
      383       98      729      222      116      225       63     6000
      475    34000    13420    21329    12073    16244    30293    11082
       78      214      113      108      280      212      138      285
      229      216      720      206      606      287      107      134
      157      540 10000000      220      103      270       82      139
      318       93       67      181      122      158      156      232
      106      155     2400      667     1286      179      349      207
      505      132      154     1400    32914    29804    18128    15890
     7750     8531     7333     7783      173      213      126      378
      417      481      780     4800      625      208      205      145
      260      193      144      227      305      831      289      246
      404      152       96      373      855     1800      519      215
      441      337    23800      218      340      231     2100      550
     4500      320     9000    12000      324      461      184      570
      444      620    11000      870      478      252      447      247
      281      980    28073    13492    12864    11472    10200      301
      111      259      171      141      256      186      174      198
      479      187      223      474      203      278      153      257
      520      185     3200      375      258      136    70000    60200
    48000    17800      264    19755    17100    12189    13375      233
      204      192      131       -1      129      149      -17      460
      382      137      143      445       91     1700      330      254
      429      813     2200      316     2600      696      291      255
      286      543      183      251      362      226      453     1080
      860      315      332      244     1351    35000     1503     1125
      725     1482      593     2079    12284    19741    12360    10099
      587    19000   500000      189      671      713     1016      176
      345      219      234      249      409      418    16000     3900
      169     7200      272      284      653      428      348      777
      253       99      201     1516      335      359      356      875
      560      177      525      686     1380      276   999999    12620
     6500     5850      188     2960      480      385      827      323
      148     1012      465      196      162      238      446      313
     2385      307      263      357      163      495     1001      541
      733      167     3600      457     5700     1650     1120     3553
      995     1600     1390      614     7600     8250      314     1580
      221     1620      470      759      267      960     1301      566
      342      880      782      241      514     2250     2470      925
      403      166     6769      146     2469      209      279      868
      585      311      683      354      308      760      387      563
      801      536      161      397      322      613      191     1750
      199      516      321     1850      277      297     4750      370
      489     1149      268     2816      789      430      978      770
      493      716      159]
[27.594 30.42  40.817 ... 30.139 35.008 54.968]
[ -81.362  -87.224  -96.71  ... -118.107 -119.132 -108.727]
[0 1]
['On the ballfield a solitary monarch butterfly flew across the field in a south-west direction at approximately 1:30 pm.'
 'Our 5th grade Discovery students who went along on an overnight field trip to Ft. Pickens, Florida, noticed that there were monarch butterflies all over the grounds of the fort the day they were there (Dec. 6,1996).'
 'We saw several hundred monarchs in our school butterfly garden,  sipping nectar from the New England asters and zinnias.'
 ...
 "There have been at least three Monarchs in my yard this year. I know it's at least three, because I often see all of them at once. But there may be more. I have lived here for 35 years, and an additional 23 years just a mile-and-a-half down the road. This is the first time in decades that I've had Monarchs in my yard, and I've been very excited that they're coming back. I'm hoping to see more in the future. "
 'One larva seen.'
 'Date of last adult sighted.Total sightings were 98 adults from June 3 to Sept. 4.Peak sightings were July 8 to Aug 7.Approx. acreage with milkweed is equal to 4.5Ac. ']
['Walker memorial junior academy' 'Hambrick elementary school'
 '-999999.999' ... 'Homosassa springs wildlife state park'
 'Director, virginia master naturalist program' -999999.999]
[ 1.00000000e+01  5.00000000e+00  6.00000000e+00  3.00000000e+00
  9.00000000e+00 -9.99999999e+05  7.00000000e+00  2.00000000e+00
  8.00000000e+00  9.90000000e+01  4.00000000e+00  1.00000000e+00
  1.20000000e+01  1.10000000e+01  0.00000000e+00  3.40000000e+01
  2.50000000e+01  4.60000000e+01  6.80000000e+01  1.50000000e+01
  9.50000000e+01  3.60000000e+01  1.80000000e+01  2.30000000e+01
  1.40000000e+01  4.50000000e+01  9.12000000e+02  2.40000000e+01
  6.90000000e+01  5.60000000e+01  7.12000000e+02  6.78000000e+02
  1.12000000e+02  4.90000000e+01  7.80000000e+01  6.70000000e+01
  1.30000000e+01  4.56000000e+02  1.90000000e+01  6.12000000e+02
  1.11200000e+03  1.60000000e+01  1.01200000e+03  3.80000000e+01
  6.30000000e+01  2.70000000e+01  1.00000000e+02  9.10000000e+02
  6.20000000e+01  3.11000000e+02  5.80000000e+01  1.70000000e+01
  2.10000000e+01  2.80000000e+01  7.10000000e+01  3.45000000e+02
  1.19000000e+02  3.50000000e+01  4.20000000e+01  6.50000000e+01
  5.00000000e+01  4.12000000e+02  7.90000000e+01  2.00000000e+01
  7.11000000e+02  5.30000000e+01  1.35000000e+02]
['-999999.999'
 'https://journeynorth.org/jnorth/images/userfiles2013/1193346010.jpg'
 'https://www.learner.org/jnorth/images/userfiles/1317067653.jpg' ...
 '//journeynorth.org/jnorth/images/userfiles2021/05/1526513089.jpg'
 '//journeynorth.org/jnorth/images/userfiles2021/05/1526513090.jpg'
 '//journeynorth.org/jnorth/images/userfiles2021/06/1526524404.jpg']

[     135      150  9701054 ... 10042506 10042509 10042557]
[-9.99999999e+05  0.00000000e+00  1.50000000e+02  2.00000000e+01
  8.90000000e+01  3.00000000e+01  2.00000000e+03  5.00000000e+01
  7.50000000e+03  2.30000000e+01  2.00000000e+02  5.00000000e+00
  3.00000000e+02  4.00000000e+00  1.00000000e+02  7.10000000e+01
  1.20000000e+02  3.25000000e+02  2.10000000e+01  2.80000000e+01
  5.00000000e+03  2.00000000e+04  3.60000000e+01  2.50000000e+01
  6.00000000e+00  5.40000000e+01  1.00000000e+03  1.60000000e+02
  2.40000000e+01  6.00000000e+01  3.70000000e+01  2.00000000e+00
  3.00000000e+03  1.00000000e+06  1.00000000e+01  1.00000000e+00
  2.00000000e+06  4.00000000e+01  8.50000000e+01  6.50000000e+01
  1.50000000e+01  8.00000000e+00  5.00000000e+02  1.40000000e+01
  1.12000000e+02  7.50000000e+01  8.00000000e+01  1.50000000e+04
  1.80000000e+01  1.00000000e+04  9.12000000e+02  1.00000000e+05
  4.00000000e+02  8.00000000e+02  1.20000000e+01  3.50000000e+01
  6.00000000e+02  1.60000000e+01  2.50000000e+04  1.50000000e+03
  1.11700000e+03  7.00000000e+01  3.00000000e+00  4.63000000e+02
  4.50000000e+01  7.20000000e+01  2.50000000e+02  1.82000000e+02
  5.60000000e+01  2.60000000e+01  3.00000000e+04  2.50000000e+03
  8.00000000e+03  7.50000000e+02  7.00000000e+02  4.60000000e+01
  5.56000000e+02  3.40000000e+01  2.75000000e+02  5.30000000e+01
  2.20000000e+01  6.50000000e+02  2.10000000e+02  2.24000000e+02
  1.10000000e+03  2.40000000e+02  2.00000000e+05  9.00000000e+02
  1.20000000e+03  7.00000000e+00  1.30000000e+01  1.15000000e+02
  1.10000000e+01  1.90000000e+01  8.10000000e+02  6.60000000e+01
  4.30000000e+01  5.10000000e+02  9.00000000e+00  6.20000000e+01
  2.70000000e+01  2.90000000e+02  1.04000000e+02  4.40000000e+01
  4.40000000e+02  2.02000000e+02  5.50000000e+01  1.80000000e+02
  1.70000000e+01  1.40000000e+02  2.69000000e+02  6.10000000e+01
  1.42000000e+02  1.75000000e+02  4.10000000e+01  1.23000000e+02
  3.20000000e+01  7.60000000e+01  3.10000000e+01  1.95000000e+02
  1.25000000e+02  2.90000000e+01  1.64000000e+02  1.09000000e+02
  1.19000000e+02  1.05000000e+02  4.00000000e+03  6.90000000e+01
  3.60000000e+02  8.80000000e+01  5.80000000e+01  2.39000000e+02
  4.80000000e+01  3.10000000e+02  1.17000000e+02  5.20000000e+01
  2.61000000e+02  9.00000000e+01  1.35000000e+02  2.96000000e+02
  2.11000000e+02  3.90000000e+01  5.10000000e+01  1.02000000e+02
  7.00100000e+03  1.27000000e+02  4.90000000e+01  4.70000000e+01
  3.30000000e+01  1.30000000e+03  4.20000000e+01  1.01000000e+02
  5.07500000e+03  1.52000000e+03  1.70000000e+02  8.10000000e+01
  1.90000000e+02  3.80000000e+01  1.10000000e+02  5.58000000e+02
  3.81000000e+02  2.28000000e+02  2.48000000e+02  8.60000000e+01
  7.40000000e+01  1.72000000e+02  2.30000000e+02  4.20000000e+02
  2.80600000e+03  9.40000000e+01  9.20000000e+01  1.18000000e+02
  4.25000000e+02  5.40000000e+03  6.30000000e+03  6.80000000e+01
  7.90000000e+01  5.00000000e+04  2.30000000e+03  7.00000000e+03
  8.40000000e+01  1.28000000e+02  5.70000000e+01  3.50000000e+02
  8.30000000e+01  1.24000000e+02  1.14000000e+02  4.50000000e+02
  1.47000000e+02  5.01000000e+02  8.70000000e+01  7.70000000e+01
  1.97000000e+02  8.40000000e+02  1.34600000e+04  3.50000000e+03
  6.40000000e+01  7.30000000e+01  1.78000000e+02  2.65000000e+02
  1.51000000e+02  1.33000000e+02  1.21000000e+02  4.77000000e+02
  5.90000000e+01  9.70000000e+01  8.50000000e+02  1.30000000e+02
  1.65000000e+02  9.50000000e+01  3.83000000e+02  9.80000000e+01
  7.29000000e+02  2.22000000e+02  1.16000000e+02  2.25000000e+02
  6.30000000e+01  6.00000000e+03  4.75000000e+02  3.40000000e+04
  1.34200000e+04  2.13290000e+04  1.20730000e+04  1.62440000e+04
  3.02930000e+04  1.10820000e+04  7.80000000e+01  2.14000000e+02
  1.13000000e+02  1.08000000e+02  2.80000000e+02  2.12000000e+02
  1.38000000e+02  2.85000000e+02  2.29000000e+02  2.16000000e+02
  7.20000000e+02  2.06000000e+02  6.06000000e+02  2.87000000e+02
  1.07000000e+02  1.34000000e+02  1.57000000e+02  5.40000000e+02
  1.00000000e+07  2.20000000e+02  1.03000000e+02  2.70000000e+02
  8.20000000e+01  1.39000000e+02  3.18000000e+02  9.30000000e+01
  6.70000000e+01  1.81000000e+02  1.22000000e+02  1.58000000e+02
  1.56000000e+02  2.32000000e+02  1.06000000e+02  1.55000000e+02
  2.40000000e+03  6.67000000e+02  1.28600000e+03  1.79000000e+02
  3.49000000e+02  2.07000000e+02  5.05000000e+02  1.32000000e+02
  1.54000000e+02  1.40000000e+03  3.29140000e+04  2.98040000e+04
  1.81280000e+04  1.58900000e+04  7.75000000e+03  8.53100000e+03
  7.33300000e+03  7.78300000e+03  1.73000000e+02  2.13000000e+02
  1.26000000e+02  3.78000000e+02  4.17000000e+02  4.81000000e+02
  7.80000000e+02  4.80000000e+03  6.25000000e+02  2.08000000e+02
  2.05000000e+02  1.45000000e+02  2.60000000e+02  1.93000000e+02
  1.44000000e+02  2.27000000e+02  3.05000000e+02  8.31000000e+02
  2.89000000e+02  2.46000000e+02  4.04000000e+02  1.52000000e+02
  9.60000000e+01  3.73000000e+02  8.55000000e+02  1.80000000e+03
  5.19000000e+02  2.15000000e+02  4.41000000e+02  3.37000000e+02
  2.38000000e+04  2.18000000e+02  3.40000000e+02  2.31000000e+02
  2.10000000e+03  5.50000000e+02  4.50000000e+03  3.20000000e+02
  9.00000000e+03  1.20000000e+04  3.24000000e+02  4.61000000e+02
  1.84000000e+02  5.70000000e+02  4.44000000e+02  6.20000000e+02
  1.10000000e+04  8.70000000e+02  4.78000000e+02  2.52000000e+02
  4.47000000e+02  2.47000000e+02  2.81000000e+02  9.80000000e+02
  2.80730000e+04  1.34920000e+04  1.28640000e+04  1.14720000e+04
  1.02000000e+04  3.01000000e+02  1.11000000e+02  2.59000000e+02
  1.71000000e+02  1.41000000e+02  2.56000000e+02  1.86000000e+02
  1.74000000e+02  1.98000000e+02  4.79000000e+02  1.87000000e+02
  2.23000000e+02  4.74000000e+02  2.03000000e+02  2.78000000e+02
  1.53000000e+02  2.57000000e+02  5.20000000e+02  1.85000000e+02
  3.20000000e+03  3.75000000e+02  2.58000000e+02  1.36000000e+02
  7.00000000e+04  6.02000000e+04  4.80000000e+04  1.78000000e+04
  2.64000000e+02  1.97550000e+04  1.71000000e+04  1.21890000e+04
  1.33750000e+04  2.33000000e+02  2.04000000e+02  1.92000000e+02
  1.31000000e+02 -1.00000000e+00  1.29000000e+02  1.49000000e+02
 -1.70000000e+01  4.60000000e+02  3.82000000e+02  1.37000000e+02
  1.43000000e+02  4.45000000e+02  9.10000000e+01  1.70000000e+03
  3.30000000e+02  2.54000000e+02  4.29000000e+02  8.13000000e+02
  2.20000000e+03  3.16000000e+02  2.60000000e+03  6.96000000e+02
  2.91000000e+02  2.55000000e+02  2.86000000e+02  5.43000000e+02
  1.83000000e+02  2.51000000e+02  3.62000000e+02  2.26000000e+02
  4.53000000e+02  1.08000000e+03  8.60000000e+02  3.15000000e+02
  3.32000000e+02  2.44000000e+02  1.35100000e+03  3.50000000e+04
  1.50300000e+03  1.12500000e+03  7.25000000e+02  1.48200000e+03
  5.93000000e+02  2.07900000e+03  1.22840000e+04  1.97410000e+04
  1.23600000e+04  1.00990000e+04  5.87000000e+02  1.90000000e+04
  5.00000000e+05  1.89000000e+02  6.71000000e+02  7.13000000e+02
  1.01600000e+03  1.76000000e+02  3.45000000e+02  2.19000000e+02
  2.34000000e+02  2.49000000e+02  4.09000000e+02  4.18000000e+02
  1.60000000e+04  3.90000000e+03  1.69000000e+02  7.20000000e+03
  2.72000000e+02  2.84000000e+02  6.53000000e+02  4.28000000e+02
  3.48000000e+02  7.77000000e+02  2.53000000e+02  9.90000000e+01
  2.01000000e+02  1.51600000e+03  3.35000000e+02  3.59000000e+02
  3.56000000e+02  8.75000000e+02  5.60000000e+02  1.77000000e+02
  5.25000000e+02  6.86000000e+02  1.38000000e+03  2.76000000e+02
  9.99999000e+05  1.26200000e+04  6.50000000e+03  5.85000000e+03
  1.88000000e+02  2.96000000e+03  4.80000000e+02  3.85000000e+02
  8.27000000e+02  3.23000000e+02  1.48000000e+02  1.01200000e+03
  4.65000000e+02  1.96000000e+02  1.62000000e+02  2.38000000e+02
  4.46000000e+02  3.13000000e+02  2.38500000e+03  3.07000000e+02
  2.63000000e+02  3.57000000e+02  1.63000000e+02  4.95000000e+02
  1.00100000e+03  5.41000000e+02  7.33000000e+02  1.67000000e+02
  3.60000000e+03  4.57000000e+02  5.70000000e+03  1.65000000e+03
  1.12000000e+03  3.55300000e+03  9.95000000e+02  1.60000000e+03
  1.39000000e+03  6.14000000e+02  7.60000000e+03  8.25000000e+03
  3.14000000e+02  1.58000000e+03  2.21000000e+02  1.62000000e+03
  4.70000000e+02  7.59000000e+02  2.67000000e+02  9.60000000e+02
  1.30100000e+03  5.66000000e+02  3.42000000e+02  8.80000000e+02
  7.82000000e+02  2.41000000e+02  5.14000000e+02  2.25000000e+03
  2.47000000e+03  9.25000000e+02  4.03000000e+02  1.66000000e+02
  6.76900000e+03  1.46000000e+02  2.46900000e+03  2.09000000e+02
  2.79000000e+02  8.68000000e+02  5.85000000e+02  3.11000000e+02
  6.83000000e+02  3.54000000e+02  3.08000000e+02  7.60000000e+02
  3.87000000e+02  5.63000000e+02  8.01000000e+02  5.36000000e+02
  1.61000000e+02  3.97000000e+02  3.22000000e+02  6.13000000e+02
  1.91000000e+02  1.75000000e+03  1.99000000e+02  5.16000000e+02
  3.21000000e+02  1.85000000e+03  2.77000000e+02  2.97000000e+02
  4.75000000e+03  3.70000000e+02  4.89000000e+02  1.14900000e+03
  2.68000000e+02  2.81600000e+03  7.89000000e+02  4.30000000e+02
  9.78000000e+02  7.70000000e+02  4.93000000e+02  7.16000000e+02
  1.59000000e+02]
[1 2 0]
['Monarch Butterfly' 'Monarch Migration' 'FIRST Monarch Butterfly'
 'FIRST Monarch Egg' 'First Monarch' 'FIRST Monarch' 'LAST Fall Monarch'
 'Monarch (OTHER observations)' 'Monarch (FIRST sighting)'
 'Monarch (FIRST seen)' 'Monarch (Other Sightings)'
 'Monarch (OTHER observation)' 'Monarch (OTHER Observation)'
 'Monarch Migration Sighting' 'Monarch (OTHER Observations)'
 'Monarch Migration Study' 'LAST Fall Monarch Sighted'
 ' LAST Fall Monarch Sighted' 'LAST Fall Monarch Migration'
 'Monarch (OTHER oservations)' 'Monarch (LAST sighting)'
 'Monarch Larva (FIRST sighted)' 'Monarch Egg (FIRST sighted)'
 'Monarch Adult (FIRST sighted)' 'Monarch Adult (FIRST Sighted)'
 'Monarch PEAK Migration' 'LAST Fall Monarch Sighting'
 'Monarchs OTHER (Observation)' '(Monarch) Milkweed emerges'
 'Monarch FIRST Migration Sighting' 'Monarch peak Migration'
 'Monarch (OTHER) Observations' 'Milkweed (FIRST Leaves)'
 'Monarch Over-wintering' 'Monarch Adult  (FIRST sighted)'
 'Monarchs (OTHER observations)' 'Monarch (IOTHER observations)'
 'Monarch Fall Roost' 'Monarch ADULT' 'Monarch Larva (FIRST Sighted)'
 'Monarch (OTHER Observations' 'Monarch Peak Migration'
 'Monarch over-wintering' 'Monarch  Adult (FIRST sighted)'
 'Monarch (Other Observations)' 'Monarch FIRST Adult'
 'Monarch Adult (First sighted)' 'Monarch (Other observations)'
 'Monarch Migration Sighting OW' 'Monarch (FIRST sighted)'
 'Monarch (NONE sighted)' 'Monarch Fall Roost (None yet)'
 'Monarch Adult Sighted' 'Monarch Sighting' 'Monarch (Other Observations'
 'Monarch Winter Sighting' 'Monarch Sighted' 'Monarch Egg Sighted'
 'Monarch Larva Sighted' 'Monarch OTHER Observations'
 'monarch (OTHER Observations)' 'Monarch Egg (FIRST Sighted)'
 'Monarch OW Mexico' 'Monarch Adult  Sighted'
 'Monarch (OTHER Observations) READY' 'Monarch Adult (FIRST sighted))'
 'Monarch, Captive-Reared' 'Monarch Fall Roost (waiting for permission)'
 'Milkweed Sighted' 'Milkweed (FIRST sighted)' 'Milkweed (FIRST Sighted)'
 'Milkweed sighted' 'Monarch, Captive Reared'
 'Monarch Egg (FIRST sighted)ghted)'
 'Monarch Adult (FIRST sighted)T sighted)'
 'Monarch Adult (FIRST sighted)sighted)' 'Monarch (Captive Reared)ed)'
 'Monarch (Captive Reared)' 'Monarch (OTHER Observations)ations)'
 'Monarch Larva Sighted ' 'Monarch Fall Roost ' 'Monarch Egg Sighted '
 'Monarch, captive-Reared' 'MOnarch Larva Sighted'
 'Monarch Adult Sighted ' 'Monarch adult Sighted' 'Monarch Adult SIghted'
 'Monarch Adult (FIRST sighted) ' 'Monarchch Adult Sighted'
 'Monarch egg Sighted' 'Monarch larva Sighted' 'Monarch , Captive-Raised'
 'Monarch, Captive' 'Monarch,' 'Monarch Adult sighted'
 'Monarch, Captive-reared']
[1 0]

In [10]:
# Determine the number of unique values in each column.
for col in JNorth1996_2020_df:
  print(JNorth1996_2020_df[col].value_counts())

850841703     1
1526350827    1
1526350816    1
1526350817    1
1526350818    1
             ..
1432512422    1
1432519704    1
1432562236    1
1432562641    1
1526525021    1
Name: id, Length: 227433, dtype: int64
2018-08-22    392
2018-10-03    377
2018-09-06    353
2019-09-19    337
2018-09-12    335
             ...
2015-12-31      1
2015-11-24      1
2015-11-22      1
2006-07-30      1
1996-12-16      1
Name: sighting_date, Length: 7491, dtype: int64
Monarch Adult Sighted            102306
Monarch Adult (FIRST sighted)     36409
Monarch Larva Sighted             17378
Monarch, Captive-Reared           14339
Monarch (OTHER Observations)      13581
Monarch Egg Sighted                8736
Milkweed (FIRST sighted)           8465
Monarch PEAK Migration             7689
Monarch Egg (FIRST sighted)        6876
Monarch Fall Roost                 5035
Monarch Larva (FIRST sighted)      4898
Milkweed Sighted                   1721
Name: species, dtype: int64
1       139319
2        24169
3        13055
4         7795
5         6118
         ...
860          1
315          1
244          1
1351         1
159          1
Name: number, Length: 555, dtype: int64
29.757    811
30.230    765
45.033    702
37.944    700
42.409    659
         ...
30.770      1
38.355      1
33.305      1
29.930      1
27.594      1
Name: latitude, Length: 18851, dtype: int64
-95.365     807
-97.714     752
-87.405     695
-93.224     620
-82.220     605
           ...
-77.529       1
-69.400       1
-101.051      1
-69.254       1
-122.557      1
Name: longitude, Length: 30123, dtype: int64
1    136009
0     91424
Name: flag_location, dtype: int64
-999999.999                                                                                                                                                               1427
Female                                                                                                                                                                     170
Flying                                                                                                                                                                     144
Male                                                                                                                                                                       118
Recorded as an incidental sighting while conducting surveys on the Fort Hood military base.                                                                                104
                                                                                                                                                                          ...
first female sighting around 3 pm in richmond-laid egg on common milkweed.  Warm sw wind -monarch looked fresh                                                               1
Spotted our first milkweed shoots in our butterfly garden at Lake Anne Elementary this afternoon after the first weekend with warmer temperatures.                           1
Spotted 1 adult near Love Valley Wildlife Reserve near the Red River.                                                                                                        1
Established Asclepias syriaca L. plants in open area have emerged approximately 1 inch in height one day after 0.7" rainfall.                                                1
Date of last adult sighted.Total sightings were 98 adults from June 3 to Sept. 4.Peak sightings were July 8 to Aug 7.Approx. acreage with milkweed is equal to 4.5Ac.        1
Name: comments, Length: 212736, dtype: int64
-999999.999                            139036
-999999.999                             63593
None                                      457
Homeschool                                331
Virginia living museum                    263
                                        ...
William e. norris elementary school         1
Coventry elementary school                  1
Adams is close                              1
Salem elementary school                     1
Walker memorial junior academy              1
Name: school, Length: 6914, dtype: int64
-999999.999    206370
 99.000          3136
 4.000           2947
 3.000           2543
 2.000           2541
                ...
 1012.000           1
 678.000            1
 69.000             1
 95.000             1
 135.000            1
Name: grade, Length: 67, dtype: int64
-999999.999                                                                   183911
//sightings.journeynorth.org/jnorth/images/userfiles2018/09/1526362818.jpg         8
https://journeynorth.org/jnorth/images/userfiles/1366245309.jpg                    3
https://journeynorth.org/jnorth/images/userfiles/1331931236.jpg                    3
//journeynorth.org/jnorth/images/userfiles2020/04/1526445894.jpg                   2
                                                                               ...
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327046.jpg             1
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327055.jpg             1
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327056.jpg             1
https://journeynorth.org/jnorth/images/userfiles2017/06/1496327063.jpg             1
//journeynorth.org/jnorth/images/userfiles2021/06/1526524404.jpg                   1
Name: image_url, Length: 43474, dtype: int64
9710973     7256
9979617     2054
9976074     1055
9975275      900
10010858     757
            ...
9979243        1
9979242        1
9979240        1
9979216        1
10042557       1
Name: customerid, Length: 42518, dtype: int64
 1.000         73436
-999999.999    64715
 2.000         24169
 3.000         13055
 4.000          7795
               ...
 445.000           1
 1700.000          1
 254.000           1
 429.000           1
 159.000           1
Name: number_old, Length: 557, dtype: int64
0    161550
1     64715
2      1168
Name: flag_number, dtype: int64
Monarch Adult Sighted                          91662
Monarch Adult (FIRST sighted)                  25311
Monarch Larva Sighted                          17373
Monarch, Captive-Reared                        14329
Monarch (OTHER Observations)                   10626
                                               ...
monarch (OTHER Observations)                       1
Monarch (OTHER Observations) READY                 1
Monarch Fall Roost (waiting for permission)        1
Monarch, Captive Reared                            1
Monarch, Captive-reared                            1
Name: species_old, Length: 96, dtype: int64
0    197793
1     29640
Name: flag_species, dtype: int64

In [11]:
# Find null values
for column in JNorth1996_2020_df.columns:
   print(f"Column {column} has {JNorth1996_2020_df[column].isnull().sum()} null values")

Column id has 0 null values
Column sighting_date has 0 null values
Column species has 0 null values
Column number has 0 null values
Column latitude has 0 null values
Column longitude has 0 null values
Column flag_location has 0 null values
Column comments has 0 null values
Column school has 0 null values
Column grade has 0 null values
Column image_url has 0 null values
Column customerid has 0 null values
Column number_old has 0 null values
Column flag_number has 0 null values
Column species_old has 0 null values
Column flag_species has 0 null values

In [12]:
# Find duplicate entries
print(f"Duplicate entries: {JNorth1996_2020_df.duplicated().sum()}")

Duplicate entries: 0

In [13]:
# filtering by type of observation (Monarch Adult Sighted)
JNorth_Adult_First_Site_df = JNorth1996_2020_df[JNorth1996_2020_df['species']=='Monarch Adult (FIRST sighted)']
JNorth_Adult_First_Site_df.head()

,id,sighting_date,species,number,latitude,longitude,flag_location,comments,school,grade,image_url,customerid,number_old,flag_number,species_old,flag_species
688,886471649,1998-02-01,Monarch Adult (FIRST sighted),1,29.957,-90.078,0,We saw 2 butterflies hatch this weekend. We b...,-999999.999,-999999.999,-999999.999,9704694,-999999.999,1,FIRST Monarch Butterfly,1
689,887033189,1998-02-08,Monarch Adult (FIRST sighted),1,30.894,-102.086,0,-999999.999,Iraan elementary,5.000,-999999.999,719,-999999.999,1,FIRST Monarch Butterfly,1
691,887158601,1998-01-17,Monarch Adult (FIRST sighted),1,28.529,-96.679,0,Netted and tagged Monarch female laying eggs o...,Victoria christian school,7.000,-999999.999,9704928,-999999.999,1,FIRST Monarch Butterfly,1
692,887283990,1998-02-12,Monarch Adult (FIRST sighted),1,28.529,-96.679,0,Have had a few Monarchs overwintering in this ...,Victoria christian school,7.000,-999999.999,9704928,-999999.999,1,FIRST Monarch Butterfly,1
694,887294257,1997-12-20,Monarch Adult (FIRST sighted),1,29.757,-95.365,0,Monarch’s have been sighted in backyards with ...,Kinkaid school,8.000,-999999.999,728,-999999.999,1,FIRST Monarch Butterfly,1

In [14]:
JNorth_Adult_First_Site_df.to_csv('JNorth_Adult_First_Site.csv', header=True, mode='w' )

In [15]:
JNorth_Adult_First_Site_df.shape

(36409, 16)

# Format file for geoJSON

In [16]:
JNorth_Adult_First_Site_df = pd.DataFrame(JNorth_Adult_First_Site_df)
JNorth_Adult_First_Site_df.drop(['id','flag_location', 'comments','school','grade','image_url','customerid','number_old','flag_number','species_old','flag_species'], axis=1, inplace=True)
JNorth_Adult_First_Site_df.head()

    sighting_date                        species  number  latitude  longitude
688    1998-02-01  Monarch Adult (FIRST sighted)       1    29.957    -90.078
689    1998-02-08  Monarch Adult (FIRST sighted)       1    30.894   -102.086
691    1998-01-17  Monarch Adult (FIRST sighted)       1    28.529    -96.679
692    1998-02-12  Monarch Adult (FIRST sighted)       1    28.529    -96.679
694    1997-12-20  Monarch Adult (FIRST sighted)       1    29.757    -95.365

In [17]:
cols = ['sighting_date', 'species', 'number', 'latitude', 'longitude']

In [18]:
JNorth_Adult_First_Site_df =JNorth_Adult_First_Site_df.groupby(['sighting_date', 'species', 'latitude', 'longitude']).sum().reset_index()
JNorth_Adult_First_Site_df.head()

  sighting_date                        species  latitude  longitude  number
0    1997-03-01  Monarch Adult (FIRST sighted)    26.220    -98.490       1
1    1997-03-01  Monarch Adult (FIRST sighted)    29.650    -94.850       1
2    1997-03-11  Monarch Adult (FIRST sighted)    29.420    -95.350       1
3    1997-03-16  Monarch Adult (FIRST sighted)    29.635    -95.635       1
4    1997-03-19  Monarch Adult (FIRST sighted)    29.635    -95.635       1

In [19]:
JNorth_Adult_First_Site_df.columns.tolist()

['sighting_date', 'species', 'latitude', 'longitude', 'number']

In [20]:
JNorth_Adult_First_Site_df.head()

  sighting_date                        species  latitude  longitude  number
0    1997-03-01  Monarch Adult (FIRST sighted)    26.220    -98.490       1
1    1997-03-01  Monarch Adult (FIRST sighted)    29.650    -94.850       1
2    1997-03-11  Monarch Adult (FIRST sighted)    29.420    -95.350       1
3    1997-03-16  Monarch Adult (FIRST sighted)    29.635    -95.635       1
4    1997-03-19  Monarch Adult (FIRST sighted)    29.635    -95.635       1

In [21]:
JNorth_Adult_First_Site_df.shape

(35489, 5)

In [22]:
JNorth_Adult_First_Site_year_df = JNorth_Adult_First_Site_df
JNorth_Adult_First_Site_year_df['year'] = pd.DatetimeIndex(JNorth_Adult_First_Site_df['sighting_date']).year

# 2006

In [23]:
JNorth_Adult_First_Site_2006_df = JNorth_Adult_First_Site_year_df[JNorth_Adult_First_Site_year_df['year']==2006]
JNorth_Adult_First_Site_2006_df.tail()

,sighting_date,species,latitude,longitude,number,year
10623,2006-11-20,Monarch Adult (FIRST sighted),40.846,-75.174,1,2006
10624,2006-11-22,Monarch Adult (FIRST sighted),28.025,-82.768,1,2006
10625,2006-11-26,Monarch Adult (FIRST sighted),36.761,-98.369,1,2006
10626,2006-12-03,Monarch Adult (FIRST sighted),41.045,-71.950,1,2006
10627,2006-12-26,Monarch Adult (FIRST sighted),19.620,-100.285,1,2006

In [24]:
JNorth_Adult_First_Site_2006_df.shape

(1895, 6)

In [25]:
JNorth_Adult_First_Site_2006_df = pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_df.drop(['year'], axis=1, inplace=True)

In [26]:
JNorth_Adult_First_Site_2006_df['month'] = pd.DatetimeIndex(JNorth_Adult_First_Site_2006_df['sighting_date']).month

## January

In [27]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_1_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==1]
JNorth_Adult_First_Site_2006_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
8733,2006-01-25,Monarch Adult (FIRST sighted),25.855,-80.185,1,1

In [28]:
JNorth_Adult_First_Site_2006_1_df.shape

(1, 6)

In [29]:
JNorth_Adult_First_Site_2006_1_df = pd.DataFrame(JNorth_Adult_First_Site_2006_1_df)
JNorth_Adult_First_Site_2006_1_df.drop(['month'], axis=1, inplace=True)

In [30]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_1_df['latitude'] = JNorth_Adult_First_Site_2006_1_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_1_df['longitude'] = JNorth_Adult_First_Site_2006_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [31]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_1_df, cols)

In [32]:
file = open("JNorth_Adult_First_Site_2006_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [33]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_2_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==2]
JNorth_Adult_First_Site_2006_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
8734,2006-02-02,Monarch Adult (FIRST sighted),29.957,-90.078,1,2
8735,2006-02-14,Monarch Adult (FIRST sighted),30.061,-95.384,1,2
8736,2006-02-24,Monarch Adult (FIRST sighted),33.543,-79.066,1,2
8737,2006-02-27,Monarch Adult (FIRST sighted),30.495,-95.003,1,2
8738,2006-02-28,Monarch Adult (FIRST sighted),30.230,-97.714,2,2

In [34]:
JNorth_Adult_First_Site_2006_2_df.shape

(5, 6)

In [35]:
JNorth_Adult_First_Site_2006_2_df= pd.DataFrame(JNorth_Adult_First_Site_2006_2_df)
JNorth_Adult_First_Site_2006_2_df.drop(['month'], axis=1, inplace=True)

In [36]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_2_df['latitude'] = JNorth_Adult_First_Site_2006_2_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_2_df['longitude'] = JNorth_Adult_First_Site_2006_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [37]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_2_df, cols)

In [38]:
file = open("JNorth_Adult_First_Site_2006_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [39]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_3_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==3]
JNorth_Adult_First_Site_2006_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
8888,2006-03-31,Monarch Adult (FIRST sighted),34.797,-96.790,1,3
8889,2006-03-31,Monarch Adult (FIRST sighted),34.907,-93.008,1,3
8890,2006-03-31,Monarch Adult (FIRST sighted),35.034,-89.934,1,3
8891,2006-03-31,Monarch Adult (FIRST sighted),35.433,-97.524,2,3
8892,2006-03-31,Monarch Adult (FIRST sighted),35.840,-97.478,1,3

In [40]:
JNorth_Adult_First_Site_2006_3_df.shape

(154, 6)

In [41]:
JNorth_Adult_First_Site_2006_3_df =pd.DataFrame(JNorth_Adult_First_Site_2006_3_df)
JNorth_Adult_First_Site_2006_3_df.drop(['month'], axis=1, inplace=True)

In [42]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_3_df['latitude'] = JNorth_Adult_First_Site_2006_3_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_3_df['longitude'] = JNorth_Adult_First_Site_2006_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [43]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_3_df, cols)

In [44]:
file = open("JNorth_Adult_First_Site_2006_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [45]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_4_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==4]
JNorth_Adult_First_Site_2006_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
9081,2006-04-29,Monarch Adult (FIRST sighted),34.346,-119.329,1,4
9082,2006-04-29,Monarch Adult (FIRST sighted),40.594,-74.624,1,4
9083,2006-04-30,Monarch Adult (FIRST sighted),33.581,-112.435,2,4
9084,2006-04-30,Monarch Adult (FIRST sighted),38.204,-75.433,1,4
9085,2006-04-30,Monarch Adult (FIRST sighted),39.787,-75.684,1,4

In [46]:
JNorth_Adult_First_Site_2006_4_df.shape

(193, 6)

In [47]:
JNorth_Adult_First_Site_2006_4_df = pd.DataFrame(JNorth_Adult_First_Site_2006_4_df)
JNorth_Adult_First_Site_2006_4_df.drop(['month'], axis=1, inplace=True)

In [48]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_4_df['latitude'] = JNorth_Adult_First_Site_2006_4_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_4_df['longitude'] = JNorth_Adult_First_Site_2006_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [49]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_4_df, cols)

In [50]:
file = open("JNorth_Adult_First_Site_2006_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [51]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_5_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==5]
JNorth_Adult_First_Site_2006_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
9357,2006-05-31,Monarch Adult (FIRST sighted),43.935,-96.829,1,5
9358,2006-05-31,Monarch Adult (FIRST sighted),43.980,-81.283,1,5
9359,2006-05-31,Monarch Adult (FIRST sighted),44.480,-93.155,1,5
9360,2006-05-31,Monarch Adult (FIRST sighted),45.333,-75.883,1,5
9361,2006-05-31,Monarch Adult (FIRST sighted),46.220,-72.000,1,5

In [52]:
JNorth_Adult_First_Site_2006_5_df.shape

(276, 6)

In [53]:
JNorth_Adult_First_Site_2006_5_df =pd.DataFrame(JNorth_Adult_First_Site_2006_5_df)
JNorth_Adult_First_Site_2006_5_df.drop(['month'], axis=1, inplace=True)

In [54]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_5_df['latitude'] = JNorth_Adult_First_Site_2006_5_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_5_df['longitude'] = JNorth_Adult_First_Site_2006_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [55]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_5_df, cols)

In [56]:
file = open("JNorth_Adult_First_Site_2006_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [57]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_6_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==6]
JNorth_Adult_First_Site_2006_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
9454,2006-06-28,Monarch Adult (FIRST sighted),39.068,-78.195,1,6
9455,2006-06-28,Monarch Adult (FIRST sighted),44.866,-63.716,1,6
9456,2006-06-28,Monarch Adult (FIRST sighted),46.850,-64.970,1,6
9457,2006-06-30,Monarch Adult (FIRST sighted),45.040,-64.730,1,6
9458,2006-06-30,Monarch Adult (FIRST sighted),45.050,-64.583,1,6

In [58]:
JNorth_Adult_First_Site_2006_6_df.shape

(97, 6)

In [59]:
JNorth_Adult_First_Site_2006_6_df=pd.DataFrame(JNorth_Adult_First_Site_2006_6_df)
JNorth_Adult_First_Site_2006_6_df.drop(['month'], axis=1, inplace=True)

In [60]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_6_df['latitude'] = JNorth_Adult_First_Site_2006_6_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_6_df['longitude'] = JNorth_Adult_First_Site_2006_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [61]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_6_df, cols)

In [62]:
file = open("JNorth_Adult_First_Site_2006_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [63]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_7_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==7]
JNorth_Adult_First_Site_2006_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
9481,2006-07-26,Monarch Adult (FIRST sighted),40.370,-105.092,1,7
9482,2006-07-29,Monarch Adult (FIRST sighted),36.119,-106.044,1,7
9483,2006-07-29,Monarch Adult (FIRST sighted),40.086,-75.152,1,7
9484,2006-07-31,Monarch Adult (FIRST sighted),40.060,-75.106,1,7
9485,2006-07-31,Monarch Adult (FIRST sighted),55.930,-82.430,1,7

In [64]:
JNorth_Adult_First_Site_2006_7_df.shape

(27, 6)

In [65]:
JNorth_Adult_First_Site_2006_7_df = pd.DataFrame(JNorth_Adult_First_Site_2006_7_df)
JNorth_Adult_First_Site_2006_7_df.drop(['month'], axis=1, inplace=True)

In [66]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_7_df['latitude'] = JNorth_Adult_First_Site_2006_7_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_7_df['longitude'] = JNorth_Adult_First_Site_2006_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [67]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_7_df, cols)

In [68]:
file = open("JNorth_Adult_First_Site_2006_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [69]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_8_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==8]
JNorth_Adult_First_Site_2006_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
9605,2006-08-31,Monarch Adult (FIRST sighted),38.604,-90.553,1,8
9606,2006-08-31,Monarch Adult (FIRST sighted),42.178,-73.333,1,8
9607,2006-08-31,Monarch Adult (FIRST sighted),43.060,-85.850,1,8
9608,2006-08-31,Monarch Adult (FIRST sighted),43.077,-85.569,1,8
9609,2006-08-31,Monarch Adult (FIRST sighted),44.664,-72.782,1,8

In [70]:
JNorth_Adult_First_Site_2006_8_df.shape

(124, 6)

In [71]:
JNorth_Adult_First_Site_2006_8_df = pd.DataFrame(JNorth_Adult_First_Site_2006_8_df)
JNorth_Adult_First_Site_2006_8_df.drop(['month'], axis=1, inplace=True)

In [72]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_8_df['latitude'] = JNorth_Adult_First_Site_2006_8_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_8_df['longitude'] = JNorth_Adult_First_Site_2006_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [73]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_8_df, cols)

In [74]:
file = open("JNorth_Adult_First_Site_2006_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [75]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_9_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==9]
JNorth_Adult_First_Site_2006_9_df.tail()

,sighting_date,species,latitude,longitude,number,month
10165,2006-09-30,Monarch Adult (FIRST sighted),42.794,-70.969,1,9
10166,2006-09-30,Monarch Adult (FIRST sighted),43.114,-70.737,1,9
10167,2006-09-30,Monarch Adult (FIRST sighted),43.223,-70.596,1,9
10168,2006-09-30,Monarch Adult (FIRST sighted),43.444,-70.349,1,9
10169,2006-09-30,Monarch Adult (FIRST sighted),44.481,-72.722,1,9

In [76]:
JNorth_Adult_First_Site_2006_9_df.shape

(560, 6)

In [77]:
JNorth_Adult_First_Site_2006_9_df = pd.DataFrame(JNorth_Adult_First_Site_2006_9_df)
JNorth_Adult_First_Site_2006_9_df.drop(['month'], axis=1, inplace=True)

In [78]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_9_df['latitude'] = JNorth_Adult_First_Site_2006_9_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_9_df['longitude'] = JNorth_Adult_First_Site_2006_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [79]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_9_df, cols)

In [80]:
file = open("JNorth_Adult_First_Site_2006_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [81]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_10_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==10]
JNorth_Adult_First_Site_2006_10_df.tail()

,sighting_date,species,latitude,longitude,number,month
10600,2006-10-30,Monarch Adult (FIRST sighted),26.026,-80.297,1,10
10601,2006-10-30,Monarch Adult (FIRST sighted),29.648,-99.224,1,10
10602,2006-10-30,Monarch Adult (FIRST sighted),30.226,-93.213,1,10
10603,2006-10-30,Monarch Adult (FIRST sighted),34.800,-83.448,1,10
10604,2006-10-31,Monarch Adult (FIRST sighted),39.643,-74.185,1,10

In [82]:
JNorth_Adult_First_Site_2006_10_df.shape

(435, 6)

In [83]:
JNorth_Adult_First_Site_2006_10_df = pd.DataFrame(JNorth_Adult_First_Site_2006_10_df)
JNorth_Adult_First_Site_2006_10_df.drop(['month'], axis=1, inplace=True)

In [84]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_10_df['latitude'] = JNorth_Adult_First_Site_2006_10_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_10_df['longitude'] = JNorth_Adult_First_Site_2006_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [85]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_10_df, cols)

In [86]:
file = open("JNorth_Adult_First_Site_2006_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [87]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_11_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==11]
JNorth_Adult_First_Site_2006_11_df.tail()

,sighting_date,species,latitude,longitude,number,month
10621,2006-11-14,Monarch Adult (FIRST sighted),29.648,-99.224,1,11
10622,2006-11-17,Monarch Adult (FIRST sighted),20.590,-100.400,1,11
10623,2006-11-20,Monarch Adult (FIRST sighted),40.846,-75.174,1,11
10624,2006-11-22,Monarch Adult (FIRST sighted),28.025,-82.768,1,11
10625,2006-11-26,Monarch Adult (FIRST sighted),36.761,-98.369,1,11

In [88]:
JNorth_Adult_First_Site_2006_11_df.shape

(21, 6)

In [89]:
JNorth_Adult_First_Site_2006_11_df = pd.DataFrame(JNorth_Adult_First_Site_2006_11_df)
JNorth_Adult_First_Site_2006_11_df.drop(['month'], axis=1, inplace=True)

In [90]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_11_df['latitude'] = JNorth_Adult_First_Site_2006_11_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_11_df['longitude'] = JNorth_Adult_First_Site_2006_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [91]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_11_df, cols)

In [92]:
file = open("JNorth_Adult_First_Site_2006_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [93]:
JNorth_Adult_First_Site_2006_month_df =pd.DataFrame(JNorth_Adult_First_Site_2006_df)
JNorth_Adult_First_Site_2006_12_df = JNorth_Adult_First_Site_2006_month_df[JNorth_Adult_First_Site_2006_month_df['month']==12]
JNorth_Adult_First_Site_2006_12_df.tail()

,sighting_date,species,latitude,longitude,number,month
10626,2006-12-03,Monarch Adult (FIRST sighted),41.045,-71.950,1,12
10627,2006-12-26,Monarch Adult (FIRST sighted),19.620,-100.285,1,12

In [94]:
JNorth_Adult_First_Site_2006_12_df.shape

(2, 6)

In [95]:
JNorth_Adult_First_Site_2006_12_df = pd.DataFrame(JNorth_Adult_First_Site_2006_12_df)
JNorth_Adult_First_Site_2006_12_df.drop(['month'], axis=1, inplace=True)

In [96]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2006_12_df['latitude'] = JNorth_Adult_First_Site_2006_12_df['latitude'].astype(float)
JNorth_Adult_First_Site_2006_12_df['longitude'] = JNorth_Adult_First_Site_2006_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [97]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2006_12_df, cols)

In [98]:
file = open("JNorth_Adult_First_Site_2006_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2007

In [99]:
JNorth_Adult_First_Site_2007_df = JNorth_Adult_First_Site_year_df[JNorth_Adult_First_Site_year_df['year']==2007]
JNorth_Adult_First_Site_2007_df.tail()

,sighting_date,species,latitude,longitude,number,year
12385,2007-12-02,Monarch Adult (FIRST sighted),39.358,-87.407,1,2007
12386,2007-12-08,Monarch Adult (FIRST sighted),33.816,-117.823,1,2007
12387,2007-12-14,Monarch Adult (FIRST sighted),33.572,-112.246,1,2007
12388,2007-12-26,Monarch Adult (FIRST sighted),19.620,-100.285,1,2007
12389,2007-12-30,Monarch Adult (FIRST sighted),36.217,-115.148,1,2007

In [100]:
JNorth_Adult_First_Site_2007_df.shape

(1762, 6)

In [101]:
JNorth_Adult_First_Site_2007_df = pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_df.drop(['year'], axis=1, inplace=True)

In [102]:
JNorth_Adult_First_Site_2007_df.tail

<bound method NDFrame.tail of       sighting_date                        species  latitude  longitude  \
10628    2007-01-01  Monarch Adult (FIRST sighted)    19.620   -100.285
10629    2007-01-03  Monarch Adult (FIRST sighted)    32.760   -116.998
10630    2007-02-19  Monarch Adult (FIRST sighted)    27.797    -97.399
10631    2007-02-22  Monarch Adult (FIRST sighted)    26.141    -81.795
10632    2007-02-22  Monarch Adult (FIRST sighted)    32.216   -110.971
...             ...                            ...       ...        ...
12385    2007-12-02  Monarch Adult (FIRST sighted)    39.358    -87.407
12386    2007-12-08  Monarch Adult (FIRST sighted)    33.816   -117.823
12387    2007-12-14  Monarch Adult (FIRST sighted)    33.572   -112.246
12388    2007-12-26  Monarch Adult (FIRST sighted)    19.620   -100.285
12389    2007-12-30  Monarch Adult (FIRST sighted)    36.217   -115.148

       number
10628       1
10629       1
10630       1
10631       1
10632       1
...       ...
12385       1
12386       1
12387       1
12388       1
12389       1

[1762 rows x 5 columns]>

In [103]:
JNorth_Adult_First_Site_2007_df['month'] = pd.DatetimeIndex(JNorth_Adult_First_Site_2007_df['sighting_date']).month

## January

In [104]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_1_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==1]
JNorth_Adult_First_Site_2007_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
10628,2007-01-01,Monarch Adult (FIRST sighted),19.62,-100.285,1,1
10629,2007-01-03,Monarch Adult (FIRST sighted),32.76,-116.998,1,1

In [105]:
JNorth_Adult_First_Site_2007_1_df.shape

(2, 6)

In [106]:
JNorth_Adult_First_Site_2007_1_df = pd.DataFrame(JNorth_Adult_First_Site_2007_1_df)
JNorth_Adult_First_Site_2007_1_df.drop(['month'], axis=1, inplace=True)

In [107]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_1_df['latitude'] = JNorth_Adult_First_Site_2007_1_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_1_df['longitude'] = JNorth_Adult_First_Site_2007_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [108]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_1_df, cols)

In [109]:
file = open("JNorth_Adult_First_Site_2007_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [110]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_2_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==2]
JNorth_Adult_First_Site_2007_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
10630,2007-02-19,Monarch Adult (FIRST sighted),27.797,-97.399,1,2
10631,2007-02-22,Monarch Adult (FIRST sighted),26.141,-81.795,1,2
10632,2007-02-22,Monarch Adult (FIRST sighted),32.216,-110.971,1,2
10633,2007-02-24,Monarch Adult (FIRST sighted),26.094,-97.671,1,2
10634,2007-02-27,Monarch Adult (FIRST sighted),19.377,-100.243,1,2

In [111]:
JNorth_Adult_First_Site_2007_2_df.shape

(5, 6)

In [112]:
JNorth_Adult_First_Site_2007_2_df = pd.DataFrame(JNorth_Adult_First_Site_2007_2_df)
JNorth_Adult_First_Site_2007_2_df.drop(['month'], axis=1, inplace=True)

In [113]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_2_df['latitude'] = JNorth_Adult_First_Site_2007_2_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_2_df['longitude'] = JNorth_Adult_First_Site_2007_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [114]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_2_df, cols)

In [115]:
file = open("JNorth_Adult_First_Site_2007_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [116]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_3_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==3]
JNorth_Adult_First_Site_2007_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
10767,2007-03-31,Monarch Adult (FIRST sighted),30.230,-97.714,1,3
10768,2007-03-31,Monarch Adult (FIRST sighted),32.874,-96.406,1,3
10769,2007-03-31,Monarch Adult (FIRST sighted),35.160,-89.756,1,3
10770,2007-03-31,Monarch Adult (FIRST sighted),35.294,-89.370,1,3
10771,2007-03-31,Monarch Adult (FIRST sighted),36.475,-81.380,1,3

In [117]:
JNorth_Adult_First_Site_2007_3_df.shape

(137, 6)

In [118]:
JNorth_Adult_First_Site_2007_3_df = pd.DataFrame(JNorth_Adult_First_Site_2007_3_df)
JNorth_Adult_First_Site_2007_3_df.drop(['month'], axis=1, inplace=True)

In [119]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_3_df['latitude'] = JNorth_Adult_First_Site_2007_3_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_3_df['longitude'] = JNorth_Adult_First_Site_2007_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [120]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_3_df, cols)

In [121]:
file = open("JNorth_Adult_First_Site_2007_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [122]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_4_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==4]
JNorth_Adult_First_Site_2007_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
10875,2007-04-30,Monarch Adult (FIRST sighted),39.056,-95.675,1,4
10876,2007-04-30,Monarch Adult (FIRST sighted),39.404,-94.521,1,4
10877,2007-04-30,Monarch Adult (FIRST sighted),39.763,-86.400,1,4
10878,2007-04-30,Monarch Adult (FIRST sighted),43.629,-96.591,1,4
10879,2007-04-30,Monarch Adult (FIRST sighted),45.000,-84.660,1,4

In [123]:
JNorth_Adult_First_Site_2007_4_df.shape

(108, 6)

In [124]:
JNorth_Adult_First_Site_2007_4_df = pd.DataFrame(JNorth_Adult_First_Site_2007_4_df)
JNorth_Adult_First_Site_2007_4_df.drop(['month'], axis=1, inplace=True)

In [125]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_4_df['latitude'] = JNorth_Adult_First_Site_2007_4_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_4_df['longitude'] = JNorth_Adult_First_Site_2007_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [126]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_4_df, cols)

In [127]:
file = open("JNorth_Adult_First_Site_2007_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [128]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_5_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==5]
JNorth_Adult_First_Site_2007_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
11153,2007-05-31,Monarch Adult (FIRST sighted),45.489,-77.680,1,5
11154,2007-05-31,Monarch Adult (FIRST sighted),46.744,-71.456,1,5
11155,2007-05-31,Monarch Adult (FIRST sighted),48.591,-85.281,1,5
11156,2007-05-31,Monarch Adult (FIRST sighted),49.530,-97.085,1,5
11157,2007-05-31,Monarch Adult (FIRST sighted),49.543,-97.054,1,5

In [129]:
JNorth_Adult_First_Site_2007_5_df.shape

(278, 6)

In [130]:
JNorth_Adult_First_Site_2007_5_df = pd.DataFrame(JNorth_Adult_First_Site_2007_5_df)
JNorth_Adult_First_Site_2007_5_df.drop(['month'], axis=1, inplace=True)

In [131]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_5_df['latitude'] = JNorth_Adult_First_Site_2007_5_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_5_df['longitude'] = JNorth_Adult_First_Site_2007_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [132]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_5_df, cols)

In [133]:
file = open("JNorth_Adult_First_Site_2007_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [134]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_6_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==6]
JNorth_Adult_First_Site_2007_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
11303,2007-06-29,Monarch Adult (FIRST sighted),42.201,-70.763,1,6
11304,2007-06-29,Monarch Adult (FIRST sighted),45.971,-64.593,1,6
11305,2007-06-29,Monarch Adult (FIRST sighted),50.922,-114.058,1,6
11306,2007-06-30,Monarch Adult (FIRST sighted),44.500,-63.516,1,6
11307,2007-06-30,Monarch Adult (FIRST sighted),45.351,-65.547,1,6

In [135]:
JNorth_Adult_First_Site_2007_6_df.shape

(150, 6)

In [136]:
JNorth_Adult_First_Site_2007_6_df = pd.DataFrame(JNorth_Adult_First_Site_2007_6_df)
JNorth_Adult_First_Site_2007_6_df.drop(['month'], axis=1, inplace=True)

In [137]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_6_df['latitude'] = JNorth_Adult_First_Site_2007_6_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_6_df['longitude'] = JNorth_Adult_First_Site_2007_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [138]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_6_df, cols)

In [139]:
file = open("JNorth_Adult_First_Site_2007_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [140]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_7_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==7]
JNorth_Adult_First_Site_2007_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
11331,2007-07-28,Monarch Adult (FIRST sighted),44.115,-79.566,1,7
11332,2007-07-28,Monarch Adult (FIRST sighted),45.050,-64.220,1,7
11333,2007-07-29,Monarch Adult (FIRST sighted),35.989,-75.654,1,7
11334,2007-07-29,Monarch Adult (FIRST sighted),45.254,-81.665,1,7
11335,2007-07-30,Monarch Adult (FIRST sighted),37.515,-92.749,1,7

In [141]:
JNorth_Adult_First_Site_2007_7_df.shape

(28, 6)

In [142]:
JNorth_Adult_First_Site_2007_7_df = pd.DataFrame(JNorth_Adult_First_Site_2007_7_df)
JNorth_Adult_First_Site_2007_7_df.drop(['month'], axis=1, inplace=True)

In [143]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_7_df['latitude'] = JNorth_Adult_First_Site_2007_7_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_7_df['longitude'] = JNorth_Adult_First_Site_2007_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [144]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_7_df, cols)

In [145]:
file = open("JNorth_Adult_First_Site_2007_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [146]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_8_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==8]
JNorth_Adult_First_Site_2007_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
11486,2007-08-31,Monarch Adult (FIRST sighted),41.328,-74.911,1,8
11487,2007-08-31,Monarch Adult (FIRST sighted),41.402,-81.827,1,8
11488,2007-08-31,Monarch Adult (FIRST sighted),42.336,-72.672,1,8
11489,2007-08-31,Monarch Adult (FIRST sighted),42.896,-78.885,1,8
11490,2007-08-31,Monarch Adult (FIRST sighted),43.801,-91.239,1,8

In [147]:
JNorth_Adult_First_Site_2007_8_df.shape

(155, 6)

In [148]:
JNorth_Adult_First_Site_2007_8_df = pd.DataFrame(JNorth_Adult_First_Site_2007_8_df)
JNorth_Adult_First_Site_2007_8_df.drop(['month'], axis=1, inplace=True)

In [149]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_8_df['latitude'] = JNorth_Adult_First_Site_2007_8_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_8_df['longitude'] = JNorth_Adult_First_Site_2007_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [150]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_8_df, cols)

In [151]:
file = open("JNorth_Adult_First_Site_2007_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [152]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_9_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==9]
JNorth_Adult_First_Site_2007_9_df.tail()

,sighting_date,species,latitude,longitude,number,month
11904,2007-09-30,Monarch Adult (FIRST sighted),38.573,-90.652,1,9
11905,2007-09-30,Monarch Adult (FIRST sighted),39.600,-74.212,1,9
11906,2007-09-30,Monarch Adult (FIRST sighted),42.335,-71.042,1,9
11907,2007-09-30,Monarch Adult (FIRST sighted),43.900,-78.850,1,9
11908,2007-09-30,Monarch Adult (FIRST sighted),52.117,-106.633,1,9

In [153]:
JNorth_Adult_First_Site_2007_9_df.shape

(418, 6)

In [154]:
JNorth_Adult_First_Site_2007_9_df = pd.DataFrame(JNorth_Adult_First_Site_2007_9_df)
JNorth_Adult_First_Site_2007_9_df.drop(['month'], axis=1, inplace=True)

In [155]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_9_df['latitude'] = JNorth_Adult_First_Site_2007_9_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_9_df['longitude'] = JNorth_Adult_First_Site_2007_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [156]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_9_df, cols)

In [157]:
file = open("JNorth_Adult_First_Site_2007_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [158]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_10_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==10]
JNorth_Adult_First_Site_2007_10_df.tail()

,sighting_date,species,latitude,longitude,number,month
12362,2007-10-31,Monarch Adult (FIRST sighted),25.420,-101.000,1,10
12363,2007-10-31,Monarch Adult (FIRST sighted),28.529,-96.679,1,10
12364,2007-10-31,Monarch Adult (FIRST sighted),29.742,-95.744,1,10
12365,2007-10-31,Monarch Adult (FIRST sighted),37.667,-75.697,1,10
12366,2007-10-31,Monarch Adult (FIRST sighted),42.172,-74.988,1,10

In [159]:
JNorth_Adult_First_Site_2007_10_df.shape

(458, 6)

In [160]:
JNorth_Adult_First_Site_2007_10_df = pd.DataFrame(JNorth_Adult_First_Site_2007_10_df)
JNorth_Adult_First_Site_2007_10_df.drop(['month'], axis=1, inplace=True)

In [161]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_10_df['latitude'] = JNorth_Adult_First_Site_2007_10_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_10_df['longitude'] = JNorth_Adult_First_Site_2007_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [162]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_10_df, cols)

In [163]:
file = open("JNorth_Adult_First_Site_2007_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [164]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_11_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==11]
JNorth_Adult_First_Site_2007_11_df.tail()

,sighting_date,species,latitude,longitude,number,month
12380,2007-11-11,Monarch Adult (FIRST sighted),37.459,-118.407,1,11
12381,2007-11-12,Monarch Adult (FIRST sighted),29.469,-98.528,1,11
12382,2007-11-14,Monarch Adult (FIRST sighted),36.918,-117.857,1,11
12383,2007-11-15,Monarch Adult (FIRST sighted),37.459,-118.407,1,11
12384,2007-11-20,Monarch Adult (FIRST sighted),36.918,-117.857,1,11

In [165]:
JNorth_Adult_First_Site_2007_11_df.shape

(18, 6)

In [166]:
JNorth_Adult_First_Site_2007_11_df = pd.DataFrame(JNorth_Adult_First_Site_2007_11_df)
JNorth_Adult_First_Site_2007_11_df.drop(['month'], axis=1, inplace=True)

In [167]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_11_df['latitude'] = JNorth_Adult_First_Site_2007_11_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_11_df['longitude'] = JNorth_Adult_First_Site_2007_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [168]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_11_df, cols)

In [169]:
file = open("JNorth_Adult_First_Site_2007_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [170]:
JNorth_Adult_First_Site_2007_month_df =pd.DataFrame(JNorth_Adult_First_Site_2007_df)
JNorth_Adult_First_Site_2007_12_df = JNorth_Adult_First_Site_2007_month_df[JNorth_Adult_First_Site_2007_month_df['month']==12]
JNorth_Adult_First_Site_2007_12_df.tail()

,sighting_date,species,latitude,longitude,number,month
12385,2007-12-02,Monarch Adult (FIRST sighted),39.358,-87.407,1,12
12386,2007-12-08,Monarch Adult (FIRST sighted),33.816,-117.823,1,12
12387,2007-12-14,Monarch Adult (FIRST sighted),33.572,-112.246,1,12
12388,2007-12-26,Monarch Adult (FIRST sighted),19.620,-100.285,1,12
12389,2007-12-30,Monarch Adult (FIRST sighted),36.217,-115.148,1,12

In [171]:
JNorth_Adult_First_Site_2007_12_df.shape

(5, 6)

In [172]:
JNorth_Adult_First_Site_2007_12_df = pd.DataFrame(JNorth_Adult_First_Site_2007_12_df)
JNorth_Adult_First_Site_2007_12_df.drop(['month'], axis=1, inplace=True)

In [173]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2007_12_df['latitude'] = JNorth_Adult_First_Site_2007_12_df['latitude'].astype(float)
JNorth_Adult_First_Site_2007_12_df['longitude'] = JNorth_Adult_First_Site_2007_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [174]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2007_12_df, cols)

In [175]:
file = open("JNorth_Adult_First_Site_2007_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2008

In [176]:
JNorth_Adult_First_Site_2008_df = JNorth_Adult_First_Site_year_df[JNorth_Adult_First_Site_year_df['year']==2008]
JNorth_Adult_First_Site_2008_df.tail()

,sighting_date,species,latitude,longitude,number,year
14060,2008-11-16,Monarch Adult (FIRST sighted),34.238,-118.549,1,2008
14061,2008-11-18,Monarch Adult (FIRST sighted),30.061,-95.384,1,2008
14062,2008-11-19,Monarch Adult (FIRST sighted),34.501,-118.059,1,2008
14063,2008-12-07,Monarch Adult (FIRST sighted),29.757,-95.365,1,2008
14064,2008-12-14,Monarch Adult (FIRST sighted),30.230,-97.714,1,2008

In [177]:
JNorth_Adult_First_Site_2008_df.shape

(1675, 6)

In [178]:
JNorth_Adult_First_Site_2008_df = pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_df.drop(['year'], axis=1, inplace=True)

In [179]:
JNorth_Adult_First_Site_2008_df.tail

<bound method NDFrame.tail of       sighting_date                        species  latitude  longitude  \
12390    2008-01-14  Monarch Adult (FIRST sighted)    32.671   -117.004
12391    2008-01-18  Monarch Adult (FIRST sighted)    28.140    -82.712
12392    2008-02-01  Monarch Adult (FIRST sighted)    29.138    -80.996
12393    2008-02-06  Monarch Adult (FIRST sighted)    27.461    -80.542
12394    2008-02-08  Monarch Adult (FIRST sighted)    29.683    -95.047
...             ...                            ...       ...        ...
14060    2008-11-16  Monarch Adult (FIRST sighted)    34.238   -118.549
14061    2008-11-18  Monarch Adult (FIRST sighted)    30.061    -95.384
14062    2008-11-19  Monarch Adult (FIRST sighted)    34.501   -118.059
14063    2008-12-07  Monarch Adult (FIRST sighted)    29.757    -95.365
14064    2008-12-14  Monarch Adult (FIRST sighted)    30.230    -97.714

       number
12390       1
12391       1
12392       1
12393       1
12394       1
...       ...
14060       1
14061       1
14062       1
14063       1
14064       1

[1675 rows x 5 columns]>

In [180]:
JNorth_Adult_First_Site_2008_df['month'] = pd.DatetimeIndex(JNorth_Adult_First_Site_2008_df['sighting_date']).month

## January

In [181]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_1_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==1]
JNorth_Adult_First_Site_2008_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
12390,2008-01-14,Monarch Adult (FIRST sighted),32.671,-117.004,1,1
12391,2008-01-18,Monarch Adult (FIRST sighted),28.140,-82.712,1,1

In [182]:
JNorth_Adult_First_Site_2008_1_df.shape

(2, 6)

In [183]:
JNorth_Adult_First_Site_2008_1_df = pd.DataFrame(JNorth_Adult_First_Site_2008_1_df)
JNorth_Adult_First_Site_2008_1_df.drop(['month'], axis=1, inplace=True)

In [184]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_1_df['latitude'] = JNorth_Adult_First_Site_2008_1_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_1_df['longitude'] = JNorth_Adult_First_Site_2008_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [185]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_1_df, cols)

In [186]:
file = open("JNorth_Adult_First_Site_2008_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [187]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_2_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==2]
JNorth_Adult_First_Site_2008_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
12395,2008-02-11,Monarch Adult (FIRST sighted),27.817,-82.626,1,2
12396,2008-02-12,Monarch Adult (FIRST sighted),29.545,-81.224,1,2
12397,2008-02-17,Monarch Adult (FIRST sighted),27.336,-82.531,1,2
12398,2008-02-22,Monarch Adult (FIRST sighted),33.768,-78.792,1,2
12399,2008-02-28,Monarch Adult (FIRST sighted),27.817,-82.729,1,2

In [188]:
JNorth_Adult_First_Site_2008_2_df.shape

(8, 6)

In [189]:
JNorth_Adult_First_Site_2008_2_df = pd.DataFrame(JNorth_Adult_First_Site_2008_2_df)
JNorth_Adult_First_Site_2008_2_df.drop(['month'], axis=1, inplace=True)

In [190]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_2_df['latitude'] = JNorth_Adult_First_Site_2008_2_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_2_df['longitude'] = JNorth_Adult_First_Site_2008_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [191]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_2_df, cols)

In [192]:
file = open("JNorth_Adult_First_Site_2008_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [193]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_3_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==3]
JNorth_Adult_First_Site_2008_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
12531,2008-03-31,Monarch Adult (FIRST sighted),30.230,-97.714,1,3
12532,2008-03-31,Monarch Adult (FIRST sighted),31.669,-89.543,1,3
12533,2008-03-31,Monarch Adult (FIRST sighted),33.639,-91.205,1,3
12534,2008-03-31,Monarch Adult (FIRST sighted),35.346,-89.922,1,3
12535,2008-03-31,Monarch Adult (FIRST sighted),36.672,-97.059,1,3

In [194]:
JNorth_Adult_First_Site_2008_3_df.shape

(136, 6)

In [195]:
JNorth_Adult_First_Site_2008_3_df = pd.DataFrame(JNorth_Adult_First_Site_2008_3_df)
JNorth_Adult_First_Site_2008_3_df.drop(['month'], axis=1, inplace=True)

In [196]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_3_df['latitude'] = JNorth_Adult_First_Site_2008_3_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_3_df['longitude'] = JNorth_Adult_First_Site_2008_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [197]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_3_df, cols)

In [198]:
file = open("JNorth_Adult_First_Site_2008_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [199]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_4_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==4]
JNorth_Adult_First_Site_2008_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
12705,2008-04-28,Monarch Adult (FIRST sighted),39.104,-94.601,1,4
12706,2008-04-28,Monarch Adult (FIRST sighted),39.844,-74.955,1,4
12707,2008-04-28,Monarch Adult (FIRST sighted),42.430,-86.216,1,4
12708,2008-04-29,Monarch Adult (FIRST sighted),44.378,-94.078,1,4
12709,2008-04-30,Monarch Adult (FIRST sighted),40.131,-85.376,1,4

In [200]:
JNorth_Adult_First_Site_2008_4_df.shape

(174, 6)

In [201]:
JNorth_Adult_First_Site_2008_4_df =pd.DataFrame(JNorth_Adult_First_Site_2008_4_df)
JNorth_Adult_First_Site_2008_4_df.drop(['month'], axis=1, inplace=True)

In [202]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_4_df['latitude'] = JNorth_Adult_First_Site_2008_4_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_4_df['longitude'] = JNorth_Adult_First_Site_2008_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [203]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_4_df, cols)

In [204]:
file = open("JNorth_Adult_First_Site_2008_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [205]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_5_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==5]
JNorth_Adult_First_Site_2008_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
12879,2008-05-31,Monarch Adult (FIRST sighted),44.501,-93.342,1,5
12880,2008-05-31,Monarch Adult (FIRST sighted),44.505,-77.472,1,5
12881,2008-05-31,Monarch Adult (FIRST sighted),44.986,-93.270,3,5
12882,2008-05-31,Monarch Adult (FIRST sighted),45.051,-93.253,1,5
12883,2008-05-31,Monarch Adult (FIRST sighted),45.267,-75.750,1,5

In [206]:
JNorth_Adult_First_Site_2008_5_df.shape

(174, 6)

In [207]:
JNorth_Adult_First_Site_2008_5_df =pd.DataFrame(JNorth_Adult_First_Site_2008_5_df)
JNorth_Adult_First_Site_2008_5_df.drop(['month'], axis=1, inplace=True)

In [208]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_5_df['latitude'] = JNorth_Adult_First_Site_2008_5_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_5_df['longitude'] = JNorth_Adult_First_Site_2008_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [209]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_5_df, cols)

In [210]:
file = open("JNorth_Adult_First_Site_2008_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [211]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_6_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==6]
JNorth_Adult_First_Site_2008_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
13099,2008-06-30,Monarch Adult (FIRST sighted),43.381,-71.065,1,6
13100,2008-06-30,Monarch Adult (FIRST sighted),44.853,-73.278,1,6
13101,2008-06-30,Monarch Adult (FIRST sighted),45.700,-73.633,1,6
13102,2008-06-30,Monarch Adult (FIRST sighted),45.970,-73.720,1,6
13103,2008-06-30,Monarch Adult (FIRST sighted),46.350,-72.550,1,6

In [212]:
JNorth_Adult_First_Site_2008_6_df.shape

(220, 6)

In [213]:
JNorth_Adult_First_Site_2008_6_df = pd.DataFrame(JNorth_Adult_First_Site_2008_6_df)
JNorth_Adult_First_Site_2008_6_df.drop(['month'], axis=1, inplace=True)

In [214]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_6_df['latitude'] = JNorth_Adult_First_Site_2008_6_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_6_df['longitude'] = JNorth_Adult_First_Site_2008_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [215]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_6_df, cols)

In [216]:
file = open("JNorth_Adult_First_Site_2008_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [217]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_7_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==7]
JNorth_Adult_First_Site_2008_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
13136,2008-07-27,Monarch Adult (FIRST sighted),38.296,-104.537,1,7
13137,2008-07-28,Monarch Adult (FIRST sighted),39.985,-75.607,1,7
13138,2008-07-29,Monarch Adult (FIRST sighted),38.494,-122.267,1,7
13139,2008-07-30,Monarch Adult (FIRST sighted),37.538,-77.436,1,7
13140,2008-07-30,Monarch Adult (FIRST sighted),43.615,-116.416,1,7

In [218]:
JNorth_Adult_First_Site_2008_7_df.shape

(37, 6)

In [219]:
JNorth_Adult_First_Site_2008_7_df = pd.DataFrame(JNorth_Adult_First_Site_2008_7_df)
JNorth_Adult_First_Site_2008_7_df.drop(['month'], axis=1, inplace=True)

In [220]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_7_df['latitude'] = JNorth_Adult_First_Site_2008_7_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_7_df['longitude'] = JNorth_Adult_First_Site_2008_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [221]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_7_df, cols)

In [222]:
file = open("JNorth_Adult_First_Site_2008_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [223]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_8_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==8]
JNorth_Adult_First_Site_2008_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
13291,2008-08-31,Monarch Adult (FIRST sighted),43.060,-85.850,1,8
13292,2008-08-31,Monarch Adult (FIRST sighted),43.061,-85.850,1,8
13293,2008-08-31,Monarch Adult (FIRST sighted),43.430,-95.150,1,8
13294,2008-08-31,Monarch Adult (FIRST sighted),43.485,-83.363,1,8
13295,2008-08-31,Monarch Adult (FIRST sighted),45.000,-79.833,1,8

In [224]:
JNorth_Adult_First_Site_2008_8_df.shape

(155, 6)

In [225]:
JNorth_Adult_First_Site_2008_8_df = pd.DataFrame(JNorth_Adult_First_Site_2008_8_df)
JNorth_Adult_First_Site_2008_8_df.drop(['month'], axis=1, inplace=True)

In [226]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_8_df['latitude'] = JNorth_Adult_First_Site_2008_8_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_8_df['longitude'] = JNorth_Adult_First_Site_2008_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [227]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_8_df, cols)

In [228]:
file = open("JNorth_Adult_First_Site_2008_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [229]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_9_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==9]
JNorth_Adult_First_Site_2008_9_df.tail()

,sighting_date,species,latitude,longitude,number,month
13717,2008-09-30,Monarch Adult (FIRST sighted),40.040,-75.479,1,9
13718,2008-09-30,Monarch Adult (FIRST sighted),40.187,-75.438,1,9
13719,2008-09-30,Monarch Adult (FIRST sighted),40.257,-74.396,1,9
13720,2008-09-30,Monarch Adult (FIRST sighted),40.752,-74.054,1,9
13721,2008-09-30,Monarch Adult (FIRST sighted),44.731,-93.291,1,9

In [230]:
JNorth_Adult_First_Site_2008_9_df.shape

(426, 6)

In [231]:
JNorth_Adult_First_Site_2008_9_df = pd.DataFrame(JNorth_Adult_First_Site_2008_9_df)
JNorth_Adult_First_Site_2008_9_df.drop(['month'], axis=1, inplace=True)

In [232]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_9_df['latitude'] = JNorth_Adult_First_Site_2008_9_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_9_df['longitude'] = JNorth_Adult_First_Site_2008_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [233]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_9_df, cols)

In [234]:
file = open("JNorth_Adult_First_Site_2008_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [235]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_10_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==10]
JNorth_Adult_First_Site_2008_10_df.tail()

,sighting_date,species,latitude,longitude,number,month
14026,2008-10-29,Monarch Adult (FIRST sighted),37.602,-121.660,1,10
14027,2008-10-29,Monarch Adult (FIRST sighted),39.107,-84.500,1,10
14028,2008-10-30,Monarch Adult (FIRST sighted),30.230,-97.714,1,10
14029,2008-10-30,Monarch Adult (FIRST sighted),39.130,-83.012,1,10
14030,2008-10-31,Monarch Adult (FIRST sighted),29.310,-81.152,1,10

In [236]:
JNorth_Adult_First_Site_2008_10_df.shape

(309, 6)

In [237]:
JNorth_Adult_First_Site_2008_10_df = pd.DataFrame(JNorth_Adult_First_Site_2008_10_df)
JNorth_Adult_First_Site_2008_10_df.drop(['month'], axis=1, inplace=True)

In [238]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_10_df['latitude'] = JNorth_Adult_First_Site_2008_10_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_10_df['longitude'] = JNorth_Adult_First_Site_2008_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [239]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_10_df, cols)

In [240]:
file = open("JNorth_Adult_First_Site_2008_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [241]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_11_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==11]
JNorth_Adult_First_Site_2008_11_df.tail()

,sighting_date,species,latitude,longitude,number,month
14058,2008-11-12,Monarch Adult (FIRST sighted),33.566,-114.626,1,11
14059,2008-11-16,Monarch Adult (FIRST sighted),28.529,-96.679,1,11
14060,2008-11-16,Monarch Adult (FIRST sighted),34.238,-118.549,1,11
14061,2008-11-18,Monarch Adult (FIRST sighted),30.061,-95.384,1,11
14062,2008-11-19,Monarch Adult (FIRST sighted),34.501,-118.059,1,11

In [242]:
JNorth_Adult_First_Site_2008_11_df.shape

(32, 6)

In [243]:
JNorth_Adult_First_Site_2008_11_df = pd.DataFrame(JNorth_Adult_First_Site_2008_11_df)
JNorth_Adult_First_Site_2008_11_df.drop(['month'], axis=1, inplace=True)

In [244]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_11_df['latitude'] = JNorth_Adult_First_Site_2008_11_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_11_df['longitude'] = JNorth_Adult_First_Site_2008_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [245]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_11_df, cols)

In [246]:
file = open("JNorth_Adult_First_Site_2008_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [247]:
JNorth_Adult_First_Site_2008_month_df =pd.DataFrame(JNorth_Adult_First_Site_2008_df)
JNorth_Adult_First_Site_2008_12_df = JNorth_Adult_First_Site_2008_month_df[JNorth_Adult_First_Site_2008_month_df['month']==12]
JNorth_Adult_First_Site_2008_12_df.tail()

,sighting_date,species,latitude,longitude,number,month
14063,2008-12-07,Monarch Adult (FIRST sighted),29.757,-95.365,1,12
14064,2008-12-14,Monarch Adult (FIRST sighted),30.230,-97.714,1,12

In [248]:
JNorth_Adult_First_Site_2008_12_df.shape

(2, 6)

In [249]:
JNorth_Adult_First_Site_2008_12_df = pd.DataFrame(JNorth_Adult_First_Site_2008_12_df)
JNorth_Adult_First_Site_2008_12_df.drop(['month'], axis=1, inplace=True)

In [250]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2008_12_df['latitude'] = JNorth_Adult_First_Site_2008_12_df['latitude'].astype(float)
JNorth_Adult_First_Site_2008_12_df['longitude'] = JNorth_Adult_First_Site_2008_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [251]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2008_12_df, cols)

In [252]:
file = open("JNorth_Adult_First_Site_2008_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2009

In [253]:
JNorth_Adult_First_Site_2009_df = JNorth_Adult_First_Site_year_df[JNorth_Adult_First_Site_year_df['year']==2009]
JNorth_Adult_First_Site_2009_df.tail()

,sighting_date,species,latitude,longitude,number,year
16523,2009-11-23,Monarch Adult (FIRST sighted),30.209,-98.657,1,2009
16524,2009-11-30,Monarch Adult (FIRST sighted),29.310,-81.152,1,2009
16525,2009-12-03,Monarch Adult (FIRST sighted),32.845,-79.811,1,2009
16526,2009-12-15,Monarch Adult (FIRST sighted),27.770,-82.637,1,2009
16527,2009-12-25,Monarch Adult (FIRST sighted),37.777,-122.217,1,2009

In [254]:
JNorth_Adult_First_Site_2009_df.shape

(2463, 6)

In [255]:
JNorth_Adult_First_Site_2009_df = pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_df.drop(['year'], axis=1, inplace=True)

In [256]:
JNorth_Adult_First_Site_2009_df.tail

<bound method NDFrame.tail of       sighting_date                        species  latitude  longitude  \
14065    2009-01-18  Monarch Adult (FIRST sighted)    33.422    -84.469
14066    2009-02-09  Monarch Adult (FIRST sighted)    29.836    -95.735
14067    2009-02-12  Monarch Adult (FIRST sighted)    30.613    -96.320
14068    2009-02-12  Monarch Adult (FIRST sighted)    32.080    -81.107
14069    2009-02-13  Monarch Adult (FIRST sighted)    27.770    -82.640
...             ...                            ...       ...        ...
16523    2009-11-23  Monarch Adult (FIRST sighted)    30.209    -98.657
16524    2009-11-30  Monarch Adult (FIRST sighted)    29.310    -81.152
16525    2009-12-03  Monarch Adult (FIRST sighted)    32.845    -79.811
16526    2009-12-15  Monarch Adult (FIRST sighted)    27.770    -82.637
16527    2009-12-25  Monarch Adult (FIRST sighted)    37.777   -122.217

       number
14065       1
14066       2
14067       1
14068       1
14069       1
...       ...
16523       1
16524       1
16525       1
16526       1
16527       1

[2463 rows x 5 columns]>

In [257]:
JNorth_Adult_First_Site_2009_df['month'] = pd.DatetimeIndex(JNorth_Adult_First_Site_2009_df['sighting_date']).month

## January

In [258]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_1_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==1]
JNorth_Adult_First_Site_2009_1_df.tail()

,sighting_date,species,latitude,longitude,number,month
14065,2009-01-18,Monarch Adult (FIRST sighted),33.422,-84.469,1,1

In [259]:
JNorth_Adult_First_Site_2009_1_df.shape

(1, 6)

In [260]:
JNorth_Adult_First_Site_2009_1_df = pd.DataFrame(JNorth_Adult_First_Site_2009_1_df)
JNorth_Adult_First_Site_2009_1_df.drop(['month'], axis=1, inplace=True)

In [261]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_1_df['latitude'] = JNorth_Adult_First_Site_2009_1_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_1_df['longitude'] = JNorth_Adult_First_Site_2009_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [262]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_1_df, cols)

In [263]:
file = open("JNorth_Adult_First_Site_2009_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## February

In [264]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_2_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==2]
JNorth_Adult_First_Site_2009_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
14077,2009-02-18,Monarch Adult (FIRST sighted),29.467,-95.967,1,2
14078,2009-02-19,Monarch Adult (FIRST sighted),28.228,-96.644,1,2
14079,2009-02-20,Monarch Adult (FIRST sighted),29.757,-95.365,1,2
14080,2009-02-26,Monarch Adult (FIRST sighted),29.996,-95.680,1,2
14081,2009-02-27,Monarch Adult (FIRST sighted),30.034,-95.261,1,2

In [265]:
JNorth_Adult_First_Site_2009_2_df.shape

(16, 6)

In [266]:
JNorth_Adult_First_Site_2009_2_df = pd.DataFrame(JNorth_Adult_First_Site_2009_2_df)
JNorth_Adult_First_Site_2009_2_df.drop(['month'], axis=1, inplace=True)

In [267]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_2_df['latitude'] = JNorth_Adult_First_Site_2009_2_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_2_df['longitude'] = JNorth_Adult_First_Site_2009_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [268]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_2_df, cols)

In [269]:
file = open("JNorth_Adult_First_Site_2009_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## March

In [270]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_3_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==3]
JNorth_Adult_First_Site_2009_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
14260,2009-03-30,Monarch Adult (FIRST sighted),35.143,-90.187,1,3
14261,2009-03-31,Monarch Adult (FIRST sighted),30.230,-97.714,1,3
14262,2009-03-31,Monarch Adult (FIRST sighted),32.347,-96.580,1,3
14263,2009-03-31,Monarch Adult (FIRST sighted),34.089,-93.050,1,3
14264,2009-03-31,Monarch Adult (FIRST sighted),38.494,-122.267,1,3

In [271]:
JNorth_Adult_First_Site_2009_3_df.shape

(183, 6)

In [272]:
JNorth_Adult_First_Site_2009_3_df = pd.DataFrame(JNorth_Adult_First_Site_2009_3_df)
JNorth_Adult_First_Site_2009_3_df.drop(['month'], axis=1, inplace=True)

In [273]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_3_df['latitude'] = JNorth_Adult_First_Site_2009_3_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_3_df['longitude'] = JNorth_Adult_First_Site_2009_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [274]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_3_df, cols)

In [275]:
file = open("JNorth_Adult_First_Site_2009_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## April

In [276]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_4_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==4]
JNorth_Adult_First_Site_2009_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
14479,2009-04-29,Monarch Adult (FIRST sighted),41.355,-72.399,1,4
14480,2009-04-30,Monarch Adult (FIRST sighted),34.391,-101.712,1,4
14481,2009-04-30,Monarch Adult (FIRST sighted),40.363,-76.143,1,4
14482,2009-04-30,Monarch Adult (FIRST sighted),40.407,-76.869,1,4
14483,2009-04-30,Monarch Adult (FIRST sighted),40.538,-88.986,1,4

In [277]:
JNorth_Adult_First_Site_2009_4_df.shape

(219, 6)

In [278]:
JNorth_Adult_First_Site_2009_4_df = pd.DataFrame(JNorth_Adult_First_Site_2009_4_df)
JNorth_Adult_First_Site_2009_4_df.drop(['month'], axis=1, inplace=True)

In [279]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_4_df['latitude'] = JNorth_Adult_First_Site_2009_4_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_4_df['longitude'] = JNorth_Adult_First_Site_2009_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [280]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_4_df, cols)

In [281]:
file = open("JNorth_Adult_First_Site_2009_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## May

In [282]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_5_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==5]
JNorth_Adult_First_Site_2009_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
14702,2009-05-31,Monarch Adult (FIRST sighted),44.297,-90.748,1,5
14703,2009-05-31,Monarch Adult (FIRST sighted),44.300,-80.100,1,5
14704,2009-05-31,Monarch Adult (FIRST sighted),44.766,-89.706,1,5
14705,2009-05-31,Monarch Adult (FIRST sighted),45.095,-93.548,1,5
14706,2009-05-31,Monarch Adult (FIRST sighted),45.701,-95.023,1,5

In [283]:
JNorth_Adult_First_Site_2009_5_df.shape

(223, 6)

In [284]:
JNorth_Adult_First_Site_2009_5_df = pd.DataFrame(JNorth_Adult_First_Site_2009_5_df)
JNorth_Adult_First_Site_2009_5_df.drop(['month'], axis=1, inplace=True)

In [285]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_5_df['latitude'] = JNorth_Adult_First_Site_2009_5_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_5_df['longitude'] = JNorth_Adult_First_Site_2009_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [286]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_5_df, cols)

In [287]:
file = open("JNorth_Adult_First_Site_2009_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## June

In [288]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_6_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==6]
JNorth_Adult_First_Site_2009_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
14872,2009-06-29,Monarch Adult (FIRST sighted),42.122,-74.394,1,6
14873,2009-06-30,Monarch Adult (FIRST sighted),42.066,-87.933,1,6
14874,2009-06-30,Monarch Adult (FIRST sighted),42.966,-85.655,1,6
14875,2009-06-30,Monarch Adult (FIRST sighted),44.474,-74.278,1,6
14876,2009-06-30,Monarch Adult (FIRST sighted),46.267,-79.300,1,6

In [289]:
JNorth_Adult_First_Site_2009_6_df.shape

(170, 6)

In [290]:
JNorth_Adult_First_Site_2009_6_df = pd.DataFrame(JNorth_Adult_First_Site_2009_6_df)
JNorth_Adult_First_Site_2009_6_df.drop(['month'], axis=1, inplace=True)

In [291]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_6_df['latitude'] = JNorth_Adult_First_Site_2009_6_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_6_df['longitude'] = JNorth_Adult_First_Site_2009_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [292]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_6_df, cols)

In [293]:
file = open("JNorth_Adult_First_Site_2009_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## July

In [294]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_7_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==7]
JNorth_Adult_First_Site_2009_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
14946,2009-07-29,Monarch Adult (FIRST sighted),41.398,-87.330,1,7
14947,2009-07-29,Monarch Adult (FIRST sighted),41.998,-89.375,2,7
14948,2009-07-29,Monarch Adult (FIRST sighted),44.112,-117.233,1,7
14949,2009-07-30,Monarch Adult (FIRST sighted),33.938,-81.380,1,7
14950,2009-07-31,Monarch Adult (FIRST sighted),33.794,-83.362,1,7

In [295]:
JNorth_Adult_First_Site_2009_7_df.shape

(74, 6)

In [296]:
JNorth_Adult_First_Site_2009_7_df = pd.DataFrame(JNorth_Adult_First_Site_2009_7_df)
JNorth_Adult_First_Site_2009_7_df.drop(['month'], axis=1, inplace=True)

In [297]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_7_df['latitude'] = JNorth_Adult_First_Site_2009_7_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_7_df['longitude'] = JNorth_Adult_First_Site_2009_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [298]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_7_df, cols)

In [299]:
file = open("JNorth_Adult_First_Site_2009_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## August

In [300]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_8_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==8]
JNorth_Adult_First_Site_2009_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
15195,2009-08-31,Monarch Adult (FIRST sighted),38.075,-82.622,1,8
15196,2009-08-31,Monarch Adult (FIRST sighted),38.801,-119.574,1,8
15197,2009-08-31,Monarch Adult (FIRST sighted),42.830,-77.724,1,8
15198,2009-08-31,Monarch Adult (FIRST sighted),45.650,-74.933,1,8
15199,2009-08-31,Monarch Adult (FIRST sighted),45.667,-86.967,1,8

In [301]:
JNorth_Adult_First_Site_2009_8_df.shape

(249, 6)

In [302]:
JNorth_Adult_First_Site_2009_8_df= pd.DataFrame(JNorth_Adult_First_Site_2009_8_df)
JNorth_Adult_First_Site_2009_8_df.drop(['month'], axis=1, inplace=True)

In [303]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_8_df['latitude'] = JNorth_Adult_First_Site_2009_8_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_8_df['longitude'] = JNorth_Adult_First_Site_2009_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [304]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_8_df, cols)

In [305]:
file = open("JNorth_Adult_First_Site_2009_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## September

In [306]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_9_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==9]
JNorth_Adult_First_Site_2009_9_df.tail()

,sighting_date,species,latitude,longitude,number,month
15841,2009-09-30,Monarch Adult (FIRST sighted),41.517,-71.277,1,9
15842,2009-09-30,Monarch Adult (FIRST sighted),41.928,-70.015,1,9
15843,2009-09-30,Monarch Adult (FIRST sighted),43.248,-88.001,2,9
15844,2009-09-30,Monarch Adult (FIRST sighted),43.503,-90.272,1,9
15845,2009-09-30,Monarch Adult (FIRST sighted),45.067,-64.633,1,9

In [307]:
JNorth_Adult_First_Site_2009_9_df.shape

(646, 6)

In [308]:
JNorth_Adult_First_Site_2009_9_df = pd.DataFrame(JNorth_Adult_First_Site_2009_9_df)
JNorth_Adult_First_Site_2009_9_df.drop(['month'], axis=1, inplace=True)

In [309]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_9_df['latitude'] = JNorth_Adult_First_Site_2009_9_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_9_df['longitude'] = JNorth_Adult_First_Site_2009_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [310]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_9_df, cols)

In [311]:
file = open("JNorth_Adult_First_Site_2009_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## October

In [312]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_10_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==10]
JNorth_Adult_First_Site_2009_10_df.tail()

,sighting_date,species,latitude,longitude,number,month
16395,2009-10-31,Monarch Adult (FIRST sighted),35.648,-79.846,1,10
16396,2009-10-31,Monarch Adult (FIRST sighted),38.212,-92.664,1,10
16397,2009-10-31,Monarch Adult (FIRST sighted),40.298,-75.210,1,10
16398,2009-10-31,Monarch Adult (FIRST sighted),40.650,-73.584,1,10
16399,2009-10-31,Monarch Adult (FIRST sighted),40.988,-76.654,1,10

In [313]:
JNorth_Adult_First_Site_2009_10_df.shape

(554, 6)

In [314]:
JNorth_Adult_First_Site_2009_10_df = pd.DataFrame(JNorth_Adult_First_Site_2009_10_df)
JNorth_Adult_First_Site_2009_10_df.drop(['month'], axis=1, inplace=True)

In [315]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_10_df['latitude'] = JNorth_Adult_First_Site_2009_10_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_10_df['longitude'] = JNorth_Adult_First_Site_2009_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [316]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_10_df, cols)

In [317]:
file = open("JNorth_Adult_First_Site_2009_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## November

In [318]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_11_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==11]
JNorth_Adult_First_Site_2009_11_df.tail()

,sighting_date,species,latitude,longitude,number,month
16520,2009-11-19,Monarch Adult (FIRST sighted),35.433,-97.524,1,11
16521,2009-11-19,Monarch Adult (FIRST sighted),35.514,-82.718,1,11
16522,2009-11-22,Monarch Adult (FIRST sighted),29.648,-99.224,1,11
16523,2009-11-23,Monarch Adult (FIRST sighted),30.209,-98.657,1,11
16524,2009-11-30,Monarch Adult (FIRST sighted),29.310,-81.152,1,11

In [319]:
JNorth_Adult_First_Site_2009_11_df.shape

(125, 6)

In [320]:
JNorth_Adult_First_Site_2009_11_df = pd.DataFrame(JNorth_Adult_First_Site_2009_11_df)
JNorth_Adult_First_Site_2009_11_df.drop(['month'], axis=1, inplace=True)

In [321]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_11_df['latitude'] = JNorth_Adult_First_Site_2009_11_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_11_df['longitude'] = JNorth_Adult_First_Site_2009_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [322]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_11_df, cols)

In [323]:
file = open("JNorth_Adult_First_Site_2009_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

## December

In [324]:
JNorth_Adult_First_Site_2009_month_df =pd.DataFrame(JNorth_Adult_First_Site_2009_df)
JNorth_Adult_First_Site_2009_12_df = JNorth_Adult_First_Site_2009_month_df[JNorth_Adult_First_Site_2009_month_df['month']==12]
JNorth_Adult_First_Site_2009_12_df.tail()

,sighting_date,species,latitude,longitude,number,month
16525,2009-12-03,Monarch Adult (FIRST sighted),32.845,-79.811,1,12
16526,2009-12-15,Monarch Adult (FIRST sighted),27.770,-82.637,1,12
16527,2009-12-25,Monarch Adult (FIRST sighted),37.777,-122.217,1,12

In [325]:
JNorth_Adult_First_Site_2009_12_df.shape

(3, 6)

In [326]:
JNorth_Adult_First_Site_2009_12_df = pd.DataFrame(JNorth_Adult_First_Site_2009_12_df)
JNorth_Adult_First_Site_2009_12_df.drop(['month'], axis=1, inplace=True)

In [327]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2009_12_df['latitude'] = JNorth_Adult_First_Site_2009_12_df['latitude'].astype(float)
JNorth_Adult_First_Site_2009_12_df['longitude'] = JNorth_Adult_First_Site_2009_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [328]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2009_12_df, cols)

In [329]:
file = open("JNorth_Adult_First_Site_2009_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# 2010

In [330]:
JNorth_Adult_First_Site_2010_df = JNorth_Adult_First_Site_df[JNorth_Adult_First_Site_df['year']==2010]
JNorth_Adult_First_Site_2010_df.tail()

,sighting_date,species,latitude,longitude,number,year
17430,2010-09-12,Monarch Adult (FIRST sighted),38.801,-119.574,1,2010
17431,2010-09-14,Monarch Adult (FIRST sighted),31.172,-83.795,1,2010
17432,2010-09-14,Monarch Adult (FIRST sighted),34.677,-77.521,1,2010
17433,2010-10-11,Monarch Adult (FIRST sighted),36.579,-121.832,1,2010
17434,2010-11-05,Monarch Adult (FIRST sighted),38.893,-77.320,1,2010

In [331]:
JNorth_Adult_First_Site_2010_df.shape

(907, 6)

In [332]:
JNorth_Adult_First_Site_2010_df = pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_df.drop(['year'], axis=1, inplace=True)

In [333]:
JNorth_Adult_First_Site_2010_df.tail

<bound method NDFrame.tail of       sighting_date                        species  latitude  longitude  \
16528    2010-02-12  Monarch Adult (FIRST sighted)    26.530    -81.826
16529    2010-03-01  Monarch Adult (FIRST sighted)    26.313    -98.392
16530    2010-03-01  Monarch Adult (FIRST sighted)    34.051   -118.143
16531    2010-03-03  Monarch Adult (FIRST sighted)    26.313    -98.392
16532    2010-03-04  Monarch Adult (FIRST sighted)    20.517    -99.867
...             ...                            ...       ...        ...
17430    2010-09-12  Monarch Adult (FIRST sighted)    38.801   -119.574
17431    2010-09-14  Monarch Adult (FIRST sighted)    31.172    -83.795
17432    2010-09-14  Monarch Adult (FIRST sighted)    34.677    -77.521
17433    2010-10-11  Monarch Adult (FIRST sighted)    36.579   -121.832
17434    2010-11-05  Monarch Adult (FIRST sighted)    38.893    -77.320

       number
16528       1
16529       1
16530       1
16531       1
16532       1
...       ...
17430       1
17431       1
17432       1
17433       1
17434       1

[907 rows x 5 columns]>

In [334]:
JNorth_Adult_First_Site_2010_df['month'] = pd.DatetimeIndex(JNorth_Adult_First_Site_2010_df['sighting_date']).month

## January

In [335]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_1_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==1]
JNorth_Adult_First_Site_2010_1_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [336]:
JNorth_Adult_First_Site_2010_1_df.shape

(0, 6)

In [337]:
JNorth_Adult_First_Site_2010_1_df = pd.DataFrame(JNorth_Adult_First_Site_2010_1_df)
JNorth_Adult_First_Site_2010_1_df.drop(['month'], axis=1, inplace=True)

In [338]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_1_df['latitude'] = JNorth_Adult_First_Site_2010_1_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_1_df['longitude'] = JNorth_Adult_First_Site_2010_1_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [339]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_1_df, cols)

In [340]:
file = open("JNorth_Adult_First_Site_2010_1.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# February

In [341]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_2_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==2]
JNorth_Adult_First_Site_2010_2_df.tail()

,sighting_date,species,latitude,longitude,number,month
16528,2010-02-12,Monarch Adult (FIRST sighted),26.53,-81.826,1,2

In [342]:
JNorth_Adult_First_Site_2010_2_df.shape

(1, 6)

In [343]:
JNorth_Adult_First_Site_2010_2_df = pd.DataFrame(JNorth_Adult_First_Site_2010_2_df)
JNorth_Adult_First_Site_2010_2_df.drop(['month'], axis=1, inplace=True)

In [344]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_2_df['latitude'] = JNorth_Adult_First_Site_2010_2_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_2_df['longitude'] = JNorth_Adult_First_Site_2010_2_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [345]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_2_df, cols)

In [346]:
file = open("JNorth_Adult_First_Site_2010_2.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# March

In [347]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_3_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==3]
JNorth_Adult_First_Site_2010_3_df.tail()

,sighting_date,species,latitude,longitude,number,month
16680,2010-03-31,Monarch Adult (FIRST sighted),30.230,-97.714,1,3
16681,2010-03-31,Monarch Adult (FIRST sighted),30.408,-99.579,1,3
16682,2010-03-31,Monarch Adult (FIRST sighted),32.304,-93.913,1,3
16683,2010-03-31,Monarch Adult (FIRST sighted),32.688,-97.611,1,3
16684,2010-03-31,Monarch Adult (FIRST sighted),32.758,-97.328,1,3

In [348]:
JNorth_Adult_First_Site_2010_3_df.shape

(156, 6)

In [349]:
JNorth_Adult_First_Site_2010_3_df = pd.DataFrame(JNorth_Adult_First_Site_2010_3_df)
JNorth_Adult_First_Site_2010_3_df.drop(['month'], axis=1, inplace=True)

In [350]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_3_df['latitude'] = JNorth_Adult_First_Site_2010_3_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_3_df['longitude'] = JNorth_Adult_First_Site_2010_3_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [351]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_3_df, cols)

In [352]:
file = open("JNorth_Adult_First_Site_2010_3.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# April

In [353]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_4_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==4]
JNorth_Adult_First_Site_2010_4_df.tail()

,sighting_date,species,latitude,longitude,number,month
16820,2010-04-28,Monarch Adult (FIRST sighted),31.260,-98.113,1,4
16821,2010-04-29,Monarch Adult (FIRST sighted),34.734,-76.754,1,4
16822,2010-04-29,Monarch Adult (FIRST sighted),38.665,-95.669,1,4
16823,2010-04-29,Monarch Adult (FIRST sighted),39.002,-95.232,1,4
16824,2010-04-30,Monarch Adult (FIRST sighted),32.788,-96.800,1,4

In [354]:
JNorth_Adult_First_Site_2010_4_df.shape

(140, 6)

In [355]:
JNorth_Adult_First_Site_2010_4_df= pd.DataFrame(JNorth_Adult_First_Site_2010_4_df)
JNorth_Adult_First_Site_2010_4_df.drop(['month'], axis=1, inplace=True)

In [356]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_4_df['latitude'] = JNorth_Adult_First_Site_2010_4_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_4_df['longitude'] = JNorth_Adult_First_Site_2010_4_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [357]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_4_df, cols)

In [358]:
file = open("JNorth_Adult_First_Site_2010_4.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# May

In [359]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_5_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==5]
JNorth_Adult_First_Site_2010_5_df.tail()

,sighting_date,species,latitude,longitude,number,month
17215,2010-05-31,Monarch Adult (FIRST sighted),46.694,-91.036,1,5
17216,2010-05-31,Monarch Adult (FIRST sighted),49.493,-98.000,2,5
17217,2010-05-31,Monarch Adult (FIRST sighted),49.689,-97.258,2,5
17218,2010-05-31,Monarch Adult (FIRST sighted),49.884,-97.141,3,5
17219,2010-05-31,Monarch Adult (FIRST sighted),49.946,-98.422,1,5

In [360]:
JNorth_Adult_First_Site_2010_5_df.shape

(395, 6)

In [361]:
JNorth_Adult_First_Site_2010_5_df = pd.DataFrame(JNorth_Adult_First_Site_2010_5_df)
JNorth_Adult_First_Site_2010_5_df.drop(['month'], axis=1, inplace=True)

In [362]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_5_df['latitude'] = JNorth_Adult_First_Site_2010_5_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_5_df['longitude'] = JNorth_Adult_First_Site_2010_5_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [363]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_5_df, cols)

In [364]:
file = open("JNorth_Adult_First_Site_2010_5.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# June

In [365]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_6_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==6]
JNorth_Adult_First_Site_2010_6_df.tail()

,sighting_date,species,latitude,longitude,number,month
17345,2010-06-30,Monarch Adult (FIRST sighted),40.971,-72.304,1,6
17346,2010-06-30,Monarch Adult (FIRST sighted),43.056,-77.520,1,6
17347,2010-06-30,Monarch Adult (FIRST sighted),43.087,-78.728,1,6
17348,2010-06-30,Monarch Adult (FIRST sighted),43.950,-79.833,1,6
17349,2010-06-30,Monarch Adult (FIRST sighted),44.648,-83.361,1,6

In [366]:
JNorth_Adult_First_Site_2010_6_df.shape

(130, 6)

In [367]:
JNorth_Adult_First_Site_2010_6_df = pd.DataFrame(JNorth_Adult_First_Site_2010_6_df)
JNorth_Adult_First_Site_2010_6_df.drop(['month'], axis=1, inplace=True)

In [368]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_6_df['latitude'] = JNorth_Adult_First_Site_2010_6_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_6_df['longitude'] = JNorth_Adult_First_Site_2010_6_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [369]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_6_df, cols)

In [370]:
file = open("JNorth_Adult_First_Site_2010_6.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# July

In [371]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_7_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==7]
JNorth_Adult_First_Site_2010_7_df.tail()

,sighting_date,species,latitude,longitude,number,month
17412,2010-07-27,Monarch Adult (FIRST sighted),37.008,-76.387,1,7
17413,2010-07-27,Monarch Adult (FIRST sighted),40.633,-76.154,1,7
17414,2010-07-29,Monarch Adult (FIRST sighted),40.694,-73.991,1,7
17415,2010-07-30,Monarch Adult (FIRST sighted),40.837,-76.899,1,7
17416,2010-07-31,Monarch Adult (FIRST sighted),39.931,-75.341,1,7

In [372]:
JNorth_Adult_First_Site_2010_7_df.shape

(67, 6)

In [373]:
JNorth_Adult_First_Site_2010_7_df = pd.DataFrame(JNorth_Adult_First_Site_2010_7_df)
JNorth_Adult_First_Site_2010_7_df.drop(['month'], axis=1, inplace=True)

In [374]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_7_df['latitude'] = JNorth_Adult_First_Site_2010_7_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_7_df['longitude'] = JNorth_Adult_First_Site_2010_7_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [375]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_7_df, cols)

In [376]:
file = open("JNorth_Adult_First_Site_2010_7.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# August

In [377]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_8_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==8]
JNorth_Adult_First_Site_2010_8_df.tail()

,sighting_date,species,latitude,longitude,number,month
17425,2010-08-04,Monarch Adult (FIRST sighted),40.678,-74.567,1,8
17426,2010-08-08,Monarch Adult (FIRST sighted),39.190,-78.160,1,8
17427,2010-08-09,Monarch Adult (FIRST sighted),43.603,-71.152,1,8
17428,2010-08-12,Monarch Adult (FIRST sighted),38.838,-77.340,1,8
17429,2010-08-13,Monarch Adult (FIRST sighted),29.154,-98.212,1,8

In [378]:
JNorth_Adult_First_Site_2010_8_df.shape

(13, 6)

In [379]:
JNorth_Adult_First_Site_2010_8_df = pd.DataFrame(JNorth_Adult_First_Site_2010_8_df)
JNorth_Adult_First_Site_2010_8_df.drop(['month'], axis=1, inplace=True)

In [380]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_8_df['latitude'] = JNorth_Adult_First_Site_2010_8_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_8_df['longitude'] = JNorth_Adult_First_Site_2010_8_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [381]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_8_df, cols)

In [382]:
file = open("JNorth_Adult_First_Site_2010_8.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# September

In [383]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_9_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==9]
JNorth_Adult_First_Site_2010_9_df.tail()

,sighting_date,species,latitude,longitude,number,month
17430,2010-09-12,Monarch Adult (FIRST sighted),38.801,-119.574,1,9
17431,2010-09-14,Monarch Adult (FIRST sighted),31.172,-83.795,1,9
17432,2010-09-14,Monarch Adult (FIRST sighted),34.677,-77.521,1,9

In [384]:
JNorth_Adult_First_Site_2010_9_df.shape

(3, 6)

In [385]:
JNorth_Adult_First_Site_2010_9_df = pd.DataFrame(JNorth_Adult_First_Site_2010_9_df)
JNorth_Adult_First_Site_2010_9_df.drop(['month'], axis=1, inplace=True)

In [386]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_9_df['latitude'] = JNorth_Adult_First_Site_2010_9_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_9_df['longitude'] = JNorth_Adult_First_Site_2010_9_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [387]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_9_df, cols)

In [388]:
file = open("JNorth_Adult_First_Site_2010_9.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# October

In [389]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_10_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==10]
JNorth_Adult_First_Site_2010_10_df.tail()

,sighting_date,species,latitude,longitude,number,month
17433,2010-10-11,Monarch Adult (FIRST sighted),36.579,-121.832,1,10

In [390]:
JNorth_Adult_First_Site_2010_10_df.shape

(1, 6)

In [391]:
JNorth_Adult_First_Site_2010_10_df = pd.DataFrame(JNorth_Adult_First_Site_2010_10_df)
JNorth_Adult_First_Site_2010_10_df.drop(['month'], axis=1, inplace=True)

In [392]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_10_df['latitude'] = JNorth_Adult_First_Site_2010_10_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_10_df['longitude'] = JNorth_Adult_First_Site_2010_10_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [393]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_10_df, cols)

In [394]:
file = open("JNorth_Adult_First_Site_2010_10.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# November

In [395]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_11_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==11]
JNorth_Adult_First_Site_2010_11_df.tail()

,sighting_date,species,latitude,longitude,number,month
17434,2010-11-05,Monarch Adult (FIRST sighted),38.893,-77.32,1,11

In [396]:
JNorth_Adult_First_Site_2010_11_df.shape

(1, 6)

In [397]:
JNorth_Adult_First_Site_2010_11_df = pd.DataFrame(JNorth_Adult_First_Site_2010_11_df)
JNorth_Adult_First_Site_2010_11_df.drop(['month'], axis=1, inplace=True)

In [398]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_11_df['latitude'] = JNorth_Adult_First_Site_2010_11_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_11_df['longitude'] = JNorth_Adult_First_Site_2010_11_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [399]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_11_df, cols)

In [400]:
file = open("JNorth_Adult_First_Site_2010_11.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()

# December

In [401]:
JNorth_Adult_First_Site_2010_month_df =pd.DataFrame(JNorth_Adult_First_Site_2010_df)
JNorth_Adult_First_Site_2010_12_df = JNorth_Adult_First_Site_2010_month_df[JNorth_Adult_First_Site_2010_month_df['month']==12]
JNorth_Adult_First_Site_2010_12_df.tail()

Empty DataFrame
Columns: [sighting_date, species, latitude, longitude, number, month]
Index: []

In [402]:
JNorth_Adult_First_Site_2010_12_df.shape

(0, 6)

In [403]:
JNorth_Adult_First_Site_2010_12_df = pd.DataFrame(JNorth_Adult_First_Site_2010_12_df)
JNorth_Adult_First_Site_2010_12_df.drop(['month'], axis=1, inplace=True)

In [404]:
# convert lat-long to floats and change address from ALL CAPS to regular capitalization
JNorth_Adult_First_Site_2010_12_df['latitude'] = JNorth_Adult_First_Site_2010_12_df['latitude'].astype(float)
JNorth_Adult_First_Site_2010_12_df['longitude'] = JNorth_Adult_First_Site_2010_12_df['longitude'].astype(float)
# JNorth_Milkweed_Site_df['street_address'] = JNorth_Milkweed_Site_df['street_address'].str.title()

In [405]:
geojson = df_to_geojson(JNorth_Adult_First_Site_2010_12_df, cols)

In [406]:
file = open("JNorth_Adult_First_Site_2010_12.geojson", "w")
json.dump(geojson, file, indent =1)
file.close()